{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.digit.in/mobile-phones/huawei-contemplating-other-retail-channels-for-honor-phones-in-india-27416.html",
    "language": "english",
    "text": "Huawei is considering other retail channels to sell its Honor branded smartphones, which have been exclusive to Flipkart right now. The move is aimed to increase the reach to a larger user base and allow the phones to reach even those users who don’t shop online. P Sanjeev , Huawei Telecommunications Director Sales told PTI, “We are seriously contemplating omnipresence sales channel strategy to expand our reach to customers. We get 75 percent of our sales from top 35 cities. We have to make plan to reach them out as everyone doesn’t buy online.” Additionally, the company has again started to sell its Huawei-branded smartphones through offline stores, but if it choose offline model for Honor brand phones as well, then it will sell only the selected models of Huawei phones to avoid the clash between the two. \nAt the moment, Huawei sells its Honor smartphones through Flipkart as part of an exclusive partnership with the e-commerce giant in India. The company has launched phones like the Honor 6, 4X, 4C, Honor Holly, and the Honor 6 Plus under the brand, some of which have been received really well. The brand aims to sell 40 million smartphones by the end of this year and it has already sold half of them within the first six months. According to reports, the company also earned $2.6 billion in revenue from the sales of Honor phones, while it is aiming to sell 1.5 to 2 million phones till the end of this year.\nHuawei has said earlier that it considers India to be amongst its most important markets. In addition, it has also showed interested in the ‘Make in India’ initiative and was the first company to receive the security clearance for the same. Earlier this week, Huawei Nexus 6P was also launched by Google, which is one of the two Nexus smartphones for this year. The pricing of the phone will be starting from Rs. 39,990 after it becomes available in India.\nMotorola  had announced last week that its phones will be available via offline stores. Motorola will currently be selling the Moto E (2015) 4G LTE variant through Airtel Stores. There are also reports of  Xiaomi partnering with Redington  to sell the Xiaomi Redmi 2, Mi Pad, Mi 4, and Mi 4i offline.  \n"
}
