{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.wired.com/2015/10/waterproof-iphone-6s/",
    "language": "english",
    "text": "Over the past few days, you may have seen reports that the iPhone 6s and 6s Plus are waterproof. In fact, not just reports; there now exist multiple videos that show Apple’s new smartphones surviving extended periods of water submersion. Those videos aren’t fabrications or pranks. Apple’s new iPhones really do hold up under water, thanks to a brilliant new technique that the company quietly pioneered.\nThat’s not to say that you should go tossing your $650+ smartphone in the toilet on purpose. As with all smartphones claiming impermeability, the new iPhones are water-resistant, not fully waterproof. If you do slip, though, you’ve got a better shot at survival than any previous generation of iPhone has offered. And the best part about Apple’s ingenious water-safe solution? It doesn’t affect the phone’s appearance, performance, or repairability in any significant way.\nWater resistance itself isn’t a novel smartphone trait; Motorola was touting the submersibility of the Defy+ as long ago as 2011. Rightly so; water’s a killer.\n“Typically, if you get a phone wet, the danger comes when you have logic board contacts with a charge running through them exposed to water,” explains Jeff Suovanen, an engineer at iFixit who recently took an iPhone 6s apart to study its water-resistant credentials. “They can short out, and afterwards they can start to corrode.” Once that happens, bye-bye phone.\nConventional wisdom leans on the brute-force method of coating a device’s case to keep the water out. “That’s what we were looking for,” says Suovanen. “We started looking at the case, the headphone jack, the Lightning port, to see if they did anything to keep water out.” Aside from a thin adhesive strip, though, nothing about the iPhone 6s exterior stood out as substantively different from the iPhone 6.\nInside, though, was another story. Suovanen quickly found that rather than waterproof the case, Apple had opted to waterproof the logic board itself.\n“It’s basically a thin wall, it almost looks like wetsuit material. It’s not that, but it looks like that. It’s soft, spongy, you can press on it and feel it give a little bit,” Suovanen says. “It’s surrounding those little logic board connectors, and then the ribbon cable connects over the top and creates a little pressure seal to keep the water out.”\nThat may sound familiar to Apple patent obsessives; the company filed one for this very technology in March of 2014. In terms of elegance, it’s the difference between trying to throw a tarp over a crowded sidewalk and handing everyone an umbrella.\n“Some of the other waterproof phones work really well, but this is more straightforward,” explains Suovanen. “Trying to waterproof a case, where you have to leave openings for ports and headphone jacks and things like that, is probably a more difficult way to do it.” Apple’s innovation amounts to introducing tactical strikes to a world that’s only ever known cluster bombing.\nIt’s natural to wonder what compromises Apple made to fit this new system under an already crowded hood, especially given that the iPhone 6s has a smaller battery than its immediate predecessor. Don’t blame the silicon seals, though, says Suovanen.\n“The battery capacity is down slightly, but I suspect that has more to do with implementing the 3D Touch technology they came out with,” the teardown specialist explains. “This year’s Taptic Engine is a bigger, thicker vibrator than the iPhone had last year, so they may not have had quite as much room left for the battery.” If a downside to the new seals does exist, no one’s spotted it yet.\nIt might seem odd, then, that Apple hasn’t trumpeted this water-resistance; surely its ability to survive a puddle dunking would have fit somewhere on the company’s marketing materials, or at least somewhere in its on-stage detailing of the devices last month. Outside of better battery life, there’s maybe no more sought-after smartphone trait than simple resilience.\nOr so one might think. The phones that have offered this level of water resistance, though, haven’t exactly been chart-toppers. The Samsung Galaxy S6 Active; the Sony Xperia Z3; the HTC Desire Eye; these are phones (or variants) you may have heard of, but their aquaphobia hasn’t demonstrably made them any more desirable. Besides which, the new iPhones aren’t necessarily more water-resistant than others, at least not in any way that’s easily perceivable to consumers; they’re just water-resistant in a more clever way.\nEven if it’s largely invisible to its customers, that cleverness could pay off soon for Apple. “Now that you can pay a small monthly fee and get a new iPhone every year, Apple’s going to be getting a lot of iPhones back,” says Suovanen of the company’s new iPhone Upgrade Plan. “In the long run this may help them save money. Because the iPhones are less susceptible to water damage, they’re getting them back in better condition.”\nThat helps explain, too, Apple opting not to coat the case itself. The same features that make a waterproof case effective make it hell to take apart or repair. “We find a lot of times with waterproof devices that getting in and out is much more difficult,” says Suovanen. “They seal them together often times with glue, and adhesives, and things that are difficult to take apart without destroying them.” That’s not ideal under any circumstances, but especially not if Apple wants to leave open the possibility of reintroducing all those trade-ins to the secondary market.\nAgain, the new iPhone isn’t invincible. If you soak it long enough, you will break it. It will, though, get through accidental drops and drips better than any iPhone before it, and at least as well as almost any other waterproof smartphone out there. Not bad for a feature that didn’t even make the spec sheet.\n"
}
