{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/9/21/9363863/edward-snowden-alien-encryption",
    "language": "english",
    "text": "Edward Snowden thinks he might have an answer to the Fermi paradox — the cosmological puzzle of why, given that the universe is so very old and so very big, we haven't heard from any aliens yet. Speaking with Neil deGrasse Tyson on the astrophysicist's StarTalk podcast (the relevant section starts 30 minutes in), Snowden suggests that a universal need to keep communications secure could mean that alien signals are simply too well encrypted to be distinguished from background noise.\n\"When you look at encrypted communications, if they are properly encrypted, there is no real way to tell that they are encrypted. You can’t distinguish a properly encrypted communication, at least in the theoretical sense, from random noise,\" says Snowden. He suggests that over time all societies realize that encryption is a necessity. \"So if you have an alien civilization trying to listen for other civilizations, or our civilization trying to listen for aliens, there's only one small period in the development of their society where all of their communications will be sent via the most primitive and most unprotected means.\"\n\"So what we're hearing is indistinguishable from cosmic microwave background radiation.\"\n\"When we think about everything we're hearing from our satellites, or everything they're hearing from our civilization, if there are indeed aliens out there, all of their communications are encrypted by default. So what we're hearing — which is actually an alien television show or a phone call or a message between their planet and their own GPS constellation, whatever it happens to be — is indistinguishable to us from cosmic microwave background radiation.\"\nThis assumes, of course, that aliens aren't trying to actively get in contact with us using would-be universally understood signals (as humans have attempted with projects like the Arecibo message). Tyson also points out that we're \"assuming they have the same security issues we have here on Earth.\" Snowden admits that it's possible that aliens are \"politically a little bit more enlightened\" than we are.\n"
}
