{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/9/30/9416579/spotify-discover-weekly-online-music-curation-interview",
    "language": "english",
    "text": "In the ‘90s, Aby Ngana Diop was the queen of taasu, a practice of ritual poetry performed by female griots in Senegal. Diop’s distinctive vocals made her a sought-after performer at the weddings and funerals of the rich and powerful, but only a single album of her work is widely available — Liital, originally released in 1994. Liital took the traditional spoken word art form and merged it with the raucous modernity of electronic synth and drum loops. The record propelled her to superstar status in Senegal. Sadly, Diop died just three years later.\nI hadn’t heard of Diop until two months ago, when someone put her on a mixtape for me. It was the first track on the playlist, and my jaw just dropped. I got out of my chair and paced around. I played the track again. She’s rapping and shouting and singing over an instrumental that mixes dancehall, electro, and traditional African drum patterns. It is very weird, very rough music, and I’m not suggesting it’s something most people would, or should, like. But for me, it was perfect.\nWith a full-time job and two young children, these days I don’t have much time to seek out new artists. But discovering new music remains a very powerful experience. Streaming services know this, and since most have very similar pricing and catalogs, curation has emerged as one of the most important areas of differentiation between them. With millions of tracks available to a subscriber of Spotify, Rdio, or any other major service — more than you could finish in a lifetime — the battleground is shifting from access to curation.\nEvery major streaming service touts its ability to learn your taste and recommend the right song at the right time. And they all use a mix of human curators and computer algorithms to target their suggestions. But increasingly, there is a divide in the industry over which half of that equation should lead and which half should follow.\nThis past June, legendary producer and major label insider Jimmy Iovine unveiled Apple Music as the grand finale of the tech titan’s semi-annual product showcase. \"It’s a revolutionary music service curated by the leading music experts who we helped handpick,\" he declared, placing Apple firmly in the human curation camp. Apple’s curation service, Iovine promised, would match the song you hear to the mood and the moment. \"Algorithms alone can’t do that emotional task. You need a human touch.\"\nWatching a live stream of the event, I found myself nodding along in agreement. Increasingly, I’ve turned to streaming services for recommendations. For the most part I’ve found them far too safe and uninspired — the equivalent of a wedding DJ who isn’t going to risk clearing the dance floor. My best discoveries still came from talking with friends.\nAll of which bring me back to Aby Ngana Diop. I got that mixtape a month and a half after I heard Iovine speak. That first track was a risky selection, and the rest of the playlist was, too. It felt like an intimate gift from someone who knew my tastes inside and out, and wasn’t afraid to throw me a curveball. But the mix didn’t come from a friend — it came from an algorithm.\nTo be exact, it came from a new Spotify service called Discover Weekly, which automatically generates a personally tailored playlist of two to three hours of music for me every week. Using Discover for the first time felt revelatory, like the first time I left AltaVista and Ask Jeeves for Google Search. The tracks it suggested weren’t all perfect, but the ones it got right cut through the clutter of stale and timid recommendations I got from most music services. They connected with such force that I didn’t mind the misses.\nSpotify has found a new way to tap the collective intelligence of its 75 million users, turning their taste into a data layer that can be used to better personalize everyone’s experience. I’m not the only one who noticed. \"It’s good. It’s better than I thought it would be,\" says tech entrepreneur and web pioneer Anil Dash. To Dash, Discover Weekly felt carefully tended, even though it was being produced by machines. \"They're as good as DJs — at scale.\"\n\"At first I was a bit skeptical,\" says Billy Chasen, founder of Turntable.fm. \"I was definitely in the camp that believes you really need people to help find music for you, [that] algorithms can only take you so far.\" After a few weeks using Discover, Chasen was a believer. \"One [song] every week is a real gem. All of a sudden it’s like, this thing is awesome.\"\nWhen Iovine called Apple Music a \"revolutionary new music service,\" people in the audience actually laughed. The company’s take is starkly traditional, a return to hand-crafted playlists and top-down DJs that radio spent decades trying to hone. But while Iovine’s claim of \"revolution\" seemed hyperbolic, his assessment of the central challenge was spot on: the only song more important than the one you’re listening to is the one that comes next. Whoever perfects this act of curation could win the streaming music war. And with Discover Weekly, Spotify may have just out-maneuvered the competition.\nFor many decades, the radio DJ was a critical gatekeeper between artist and fan — Elvis Presley was a little-known crooner until Memphis DJ Dewey Phillips threw his first single, \"That’s Alright,\" on repeat for two hours during his popular afternoon broadcast. The radio DJ was also a curator for the masses, shaping the evolution of genres by playing unknown tracks that crossed their desk or promoting local acts they had come to love and champion.\nBut with its limited channels, radio had to be many things to many people. You could tune it to your taste by spinning the dial to find your favorite station or DJ, but the closest commercial radio got to personalization was letting listeners call in to request their favorite song.\nAt a macro level, however, the radio industry had developed an art and a science to curation, much of which still undergirds attempts to personalize and recommend songs in the digital world. By the late 1980s, radio stations had largely replaced the personal preference of the DJ for playlist selection. Specialists known as \"programmers\" (not the computer kind) decided what was played, and relied on a practice called \"clocking\" to sequence it. A rock show, for instance, would divide songs into buckets: a power hit at the top of the hour to suck you in, an old favorite to build trust, then an obscure nugget to surprise and delight you. Stations ran through the cycle in a carefully timed and arranged order, tweaking and refining the mix based on the relatively limited audience response data.\nAs radio stations consolidated over the decades, companies cut down on local hosts and standardized playlists across their properties in order to maximize efficiency — and profits. \"You end up with very little variation from market to market when it comes to not just music but also personality,\" says Matt Bates, the global head of curation at Rdio, who worked for more than a decade in terrestrial radio.\nBut as traditional radio was homogenizing, the rise of the internet and digital music was opening up enormous new avenues to curate and personalize music curation and personalization. Online, users were no longer limited by the range of a radio tower, and broadcasters were no longer limited to producing a single, monolithic stream. For the first time in history, it was possible to send unique recommendation to millions of listeners, and to collect detailed data on their listening habits.\n\"In the late ‘90s, early 2000s, people saw Google, they saw MP3s and they put two and two together and said, ‘Hey, how do we build search engines for music?’\" recalls J. Stephen Downie, a professor of library science at the University of Illinois and founder of the International Society of Music Information Retrieval. That meant a basic system that could pull up a song or artist when you searched for them in a library. But it also meant creating a system for generating data about how music sounded — and creating a program to power recommendation.\nRdio’s recommendations felt accurate, but impersonal. The service did some basic collaborative filtering to come up with its personalized suggestions: because I like Sly and The Family Stone, I like funk and soul. From there it recommended seven albums, all best hit collections of extremely well known artists. But I love the slider that lets you adjust between familiar favorites and serious exploration. With that filter set to hardcore discovery and some judicious skipping, I found myself quickly enjoying the feed.\nApple gave me a broad selection of hand made playlists, many of which fit my taste. The hip hop offerings took me behind the boards with the producers of my favorite songs and for indie rock there was a good, if generic, lazy Sunday morning mix. But I also got numerous playlists prominently featuring Dr. Dre, even though I own none of his albums and don’t remember selecting west coast rap as one of my favorite genres during the onboarding process. Personalization and nepotism don’t mix.\nTidal recognized I was the kind of guy who enjoys hearing a hip hop track and the original song it samples. I am also a fan of 60s soul. The playlists Tidal offered me were hit or miss, but at least they fit my taste. I have zero clue, on the other hand, why Tidal suggested a Metalcore mega or New Jack Swing mixes. And the Lana Del Ray-inspired playlist featuring Judy Garland and Cher was about as far from my sweet spot as you can get.\nThe recommendations here were limited to radio streams. It’s very basic collaborative filtering and doesn’t feel like its offering much guidance about what I should listen to or why it’s right for me. But Google does have a \"I’m feeling lucky\" button, just like it does on its flagship search engine. That played a personalized stream, and several of the selections were songs I had also been given by Discover Weekly. To me this suggests that Google, not surprisingly, will be Spotify’s toughest competitor.\nToday, the world of curation in streaming music is a spectrum, with each service offering its own blend of human editorial and algorithmically generated selections. One branch of digital curation pursues this goal through acoustic analysis. \"I run a team of about 30 music analysts, and their job is to listen to each song we’re putting on the service,\" says Eric Bieschke, the chief data scientist and VP of playlists at Pandora, a company considered to be the grandaddy of music streaming. \"They do a detailed analysis that describes what kind of instruments are in the song, what those instruments are doing. They detail harmony, melody, rhythm, what the voices sound like.\" That technique, while refined over the years, is fundamentally unchanged since the company’s inception 15 years ago.\nPandora takes that data and uses it to relate songs to one another, and to understand a listener’s taste. You start a radio stream with a \"seed\": the track, artists, or album that it can recommend against. From there, as you decide which songs to like, dislike, skip, or repeat, algorithms track your taste and recommend songs with matching attributes. This approach has been successful: today, Pandora is the world’s largest streaming service, with 79 million listeners tuning in for an average of 20 hours a month.\nOther streaming services also use some version of Pandora’s \"adjustable radio\" approach. You input an artist, album, or genre, and it cues up a never-ending stream of tracks pegged off that clue. Google Play Music and Rdio both offer this — Rdio has a station, You.fm, that users can dip in and out of without any seed at all. It starts with its knowledge of your taste, then adjusts based on your device, or the time of day, what you want to hear.\nSlacker Radio decided to take a different approach, leaning heavily on terrestrial radio techniques to batch songs. Instead of starting with a seed, listeners pick a station with a traditional format — blues, hard rock, easy listening — which feature big buckets of songs chosen and clocked by a human with experience in terrestrial radio. From there, Slacker uses algorithms to personalize the station based on a user’s activity.\nAll these services used a technique called collaborative filtering to improve their recommendations. Collaborative filtering means that individuals who like James Brown will probably like Otis Redding. More complex implementations can pick up on deeper patterns: people who like these three particular albums from The White Stripes also like The Dead Weather.\nStill other services abandoned personalization entirely and bank on genres, mood, or activity. Startups like 8Track and Songza, acquired by Google last year, offered pre-made collections for Study Hall Focus, Backyard BBQ, and Rainy Sunday Afternoon. You could even search for playlists made by users like you.\nThese dueling approaches ran into two problems. Human curation doesn’t scale, which is why Pandora has just 2 million songs and Apple Music just a few thousand playlists. Algorithms, on the other hand, have little grasp of the cultural and historical attributes of songs. In trying to help you discover new music, they can throw together tracks that miss your taste by a mile, happened to be on the same compilation but are otherwise entirely unrelated, or sound terrible next to one another.\nUntil Discover Weekly launched this past July, no major streaming service had tried to combine a static playlist with personalized recommendation that fit a single user. There have been individually personalized streams, like Rdio’s You.fm, and plenty of static playlists created by humans. Apple Music and Amazon Prime, for instance, broadly target playlists to users based on the artists and albums they play, but you and I won’t receive different versions of Apple’s \"Hip-Hop Essentials\" based on our taste in rap or our listening history.\nThe reason no one attempted something like Discover Weekly until now is because a static, personalized playlist is very risky. A radio stream usually begins with a prompt from the user and can adjust in real time based on a user’s feedback. Discover Weekly, by contrast, is two hours of music you get once a week with no real explanation of why you’re getting these tracks, or how to influence that process. Just like handing a mix tape to your crush in real life, once you finalize the playlist, you’re committed. Somehow Spotify’s algorithms manage to deliver me a consistently great experience. I visited Spotify’s New York office to find out how it worked.\nThere is a room on the third floor of Spotify’s New York City headquarters that is in particularly high demand. \"Once I turn on the sound system, you’ll see why,\" says Matthew Ogle, the product lead on Discover Weekly. The room’s walls are well padded and decorated in old album covers — two very comfy chairs sit in front of a pair of massive speakers.\nOgle wears Elvis Costello glasses — dressed nattily in a white dress shirt buttoned to the top, slim fit jeans, and expensive sneakers, he sported a millennial business casual attire that I recognized from the young record executive on Amazon’s Transparent. Before Spotify, Ogle worked at Last.fm and ran his own startup, This Is My Jam.\nWe sat down to play each other some of our favorite tracks from Discover Weekly. I cued up \"Today\" by Tom Scott. It’s from his album called The California Dreamers and opens on a mellow psychedelic guitar riff with dulcet harmonies. The first time I heard it, tucked into the middle of my seventh edition of Discover Weekly, I assumed it was going to be some lovely mid-tempo psych-folk. That made sense, considering my listening history.\nBut at the 1-minute mark, a saxophone solo comes in. Something about the rough tone of the horn stirred a flicker of recognition in me. Thirty seconds later, an absolutely vicious lick on the sax caused my jaw to contort, a condition my wife lovingly refers to as stank face. Listening to it again on the massive speakers at Spotify’s office, the effect was electric.\n\"Today\" contains the sample to \"They Reminiscence Over You,\" a hip-hop classic I’ve spun on Spotify dozens of times. Spotify knew I had never heard \"Today,\" at least not on their service, and was therefore ripe to be thrilled at connecting the dots. It was a recommendation driven less by the way the music sounds, or genre, than by the cultural and historical web that gives music so much of its power.\nThe technology that makes Discover Weekly possible comes in part from a Boston-based startup called The Echo Nest, which Spotify acquired in March of 2014. Ogle worked there for two years before joining Spotify, and since the acquisition, Spotify has put The Echo Nest employees in charge of its biggest and most important new curation and discovery products.\nThe Echo Nest co-founder and CEO Brian Whitman started out as an experimental electronic musician, but was inspired by the rise of Napster and streaming radio. He switched gears and eventually got a PhD in machine listening from MIT. There, he created a program that could crawl the web, reading and interpreting music blogs and reviews, learning what songs critics thought were \"edgy\" or \"old school.\" After graduating in 2005, Whitman helped found  The Echo Nest, which combined that technology with acoustic analysis and collaborative filtering.\nThe company became one of the best in the business and helped power recommendation systems for Rdio, Spotify, Deezer, iHeartRadio, and Rhapsody. But it never had a massive user base of its own that it could leverage to build new tools. \"You have really good people, you have some really good algorithms. They’re only [as] good as the data that you have,\" says professor Downie. That changed when The Echo Nest became part of Spotify and could tap its 75 million users.\nThe combination of The Echo Nest technology and Spotify’s massive data trove led to Discover Weekly. Here’s how it works: Spotify has built a taste profile for each user based on what they listen to. It assigns an affinity score to artists, which is the algorithm’s best guess of how central they are to your taste. It also looks at which genres you play the most to decide where you would be willing to explore new music.\nThe algorithms behind Discover Weekly finds users who have built playlists featuring the songs and artists you love. It then goes through songs that a number of your kindred spirits have added to playlists but you haven’t heard, knowing there is a good chance you might like them, too. Finally, it uses your taste profile to filter those findings by your areas of affinity and exploration. Because the playlist, that explicit act of curation, is both the source of the signal and the final output, the technique can achieve results far more interesting than run of the mill collaborative filtering.\nIn a sense, the system works like the original Page Rank, (named for Larry Page), the technique Google used to revolutionize web search. Page Rank crawled the web to find hyperlinks and treated each one as a vote pointing toward useful information. A big batch of links pointing to a website about Elvis indicated to Google that site was a good resource on the The King. In Discover Weekly, each time a user with similar taste playlists a certain song, it’s a vote that the song will sound good to you when paired with other tracks on that playlist.\n  Ajay Kalia, the product lead for Taste Profiles, says its crucial to keep humans in the loop. There is a camp that believes if you just have enough data, and smarter algorithms, a curation machine will emerge discovers new and innovative ways to predict your taste. That might be true when sorting data on weather, says Kalia, but not for something as emotional as music. \"I think we'll always have to start with patterns that map to the way people actually relate to music.\"  \nIt’s still humans who are doing the song selection and arranging, but instead of outside experts, it’s users like you and me. Generating a human-curated playlist for each of Spotify’s users would be a challenge of mammoth proportion. \"We probably can’t hire enough editors to do that,\" says Ogle. So Spotify uses each of its users as one cog in a company-wide curatorial machine. \"The answer was staring us in the face: playlists, since the beginning, have been more or less the basic currency of Spotify. Users have made more than 2 billion of them.\" In effect, Discover Weekly sidesteps the man versus machine debate and delivers the holy grail of music recommendation: human curation at scale.\nDiscover Weekly is amazing, but it’s far from perfect. For every gem Spotify gave me, there was one mediocre track and another dud. The songs were also often sequenced terribly, with tracks coming one after another that simply did not flow.\nThat uncertainty is probably why no other streaming music service currently attempts this feat. \"If we give you two songs you like and one you don’t, we’ve failed,\" Pandora’s Bieschke told me. Jimmy Iovine took a similar tack when introducing Apple Music. There is no greater sin, he declared, than the buzzkill of a bad song after a good one.\nTo avoid the buzzkill pitfall, Apple uses human editors. But that drastically limits the number of playlists it can produce — even Apple can’t afford to hire a dedicated editor to make a weekly playlist for each listener. As a result, Apple’s broad, safe method is far less likely to surprise and delight. \"When you’re trying to analyze large sets of data, you do tend to flatten out the spikes that might be interesting,\" explains Turntable.fm’s Chasen.\n  \"If we give you two songs you like and one you don’t, we’ve failed.\"   \nWhitman is currently taking the lead on another product Spotify recently introduced, Fresh Finds. The system crawls tens of thousands of blogs, news sites, and reviews to figure out what tastemakers are talking about and generate a trending chart of unknown music that’s about to catch on. It’s human curation, but gathered by an automated system that doesn’t even know their names. \"We think of it as a data layer to tap into, their taste,\" says Whitman.\nAs streaming services like Apple and Tidal recruit young artists for exclusives on their platform, Whitman hopes his algorithms will eventually help Spotify source the best new acts. \"Fresh Finds is an amazing tool we use internally for things like artist relations. We have nothing to announce right now, but I think in the future you’ll see more about how we can use these predictive algorithms to make sure these artists come to Spotify.\" You can imagine the traditional A&R department at a major record label salivating at the predictive possibilities. If the most important thing in music is the song that comes on next, identifying my favorite track before it has been created offers Spotify a massive advantage.\nWhen I was visiting Ogle at Spotify headquarters, he showed me a favorite track Discover Weekly had recommended him. It was a meandering organ solo over a spare whurlitzer beat. The song, 1972’s \"Why We Can’t Live Together,\" was a strange hit from session musician Timmy Thomas. I couldn’t place it until Ogle cued \"Hotline Bling,\" a massive hit from Drake currently in constant rotation on the radio. That tiny wurlitzer was the sample anchoring the beat.\nI assumed that the obscure track had been recommended to Ogle because of how often he played the song that sampled it. \"Actually no, I got this during testing, a couple of months before that song came out,\" Ogle said. He cracked a broad smile. \"I like to think maybe Drake got the idea the same way.\"\n"
}
