{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/9/30/9429795/lg-v10-phone-availability-price",
    "language": "english",
    "text": "September has been full of major phone announcements, and LG has decided to join the party with just a few days to spare. The company just announced a new premium phone called the V10 less than a day ahead of a scheduled event in New York City. It's the first phone in the company's new \"V\" line of phones, which bumps up a few key specs while ditching plastic for more premium materials.\nThe new V10 isn't terribly different from LG's flagship G4 on the inside. It has the same (removable) 3,000 mAh battery, the same Snapdragon 808 processor, and the same 16-megapixel rear camera. (There is an extra gigabyte of RAM, however). On the outside, though, the V10 appears to have left the G4's curved display behind for a flat one. The phone's also built out of higher-grade materials, with LG opting for stainless steel and silicone over plastic.\nThere are also a few other particularly distinguishing features, some of which are pretty wild. First, there are two screens on the front of the device. There's the main, 5.7-inch QHD display, and just above that is a much smaller \"always on\" screen that can do a number of things. When the main screen is off, the second screen can display the weather, time and date, and battery level. When the main screen is on, the second screen can be used to for quick-launching apps, accessing favorite contacts, or serve up notifications. All in all, it sounds like it works a lot like the Edge screen found on Samsung's Galaxy S6 and Note Edge devices.\nNext to that second screen is not one, but two front-facing cameras. Both are of the 5-megapixel variety, but one has a fairly wide field of view of 120 degrees while the other is a bit more narrow, measuring just 80 degrees. The different fields of view mean that the two cameras can't be used to create 3D images, but LG does say that the V10 has software that can combine images taken concurrently by the two lenses.\nThe phone is all new, but there are echoes of the G4\nThe V10 shares the same camera as LG's G4, but it appears that the company is pushing the camera's software capabilities this time around — especially when it comes to shooting video. (The announcement even goes so far as to say that LG hopes the V10 will do \"for video what the G4 did for photographs.\") V10 users will have full manual control over things like shutter speed, ISO, white balance, focus, and frame rate. The V10 can shoot video in HD, FHD, or UHD resolution, and there's even an option to shoot in a 21:9 aspect ratio. The camera also has both optical and electronic image stabilization.\nLG's new V10 sounds a lot like the G4, but with enough bumps in performance and material that you'd expect a higher price. And while it wouldn't be surprising if the V10 commands more at retailers than the G4 does, LG is holding off on announcing pricing for now. All we know is that the new phone will be available in South Korea this month, and will make it to the US, China, and a few other countries soon thereafter. The V10 will be available in five colors — black, white, beige, and two different blues — and will come in one storage variant (64GB).\n"
}
