{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.thehindu.com/news/international/putin-takes-syria-spotlight-us-coalition-wants-focus-on-is/article7716046.ece",
    "language": "english",
    "text": " The presidents of Russia and France, which both started bombing Syria this week, held talks on Friday about their military operations as they tried to overcome differences on whether Syrian President Bashar Assad should stay in power. \nRussian President Vladimir Putin and French President Francois Hollande met in Paris after a week of frenzied international activity around Syria that finally broke into Friday’s meeting, which was supposed to have been only about Ukraine. \nA senior French diplomat said the two leaders tried to bridge the differences over an eventual political transition in Syria, as well as talking about the air strikes by Russia and the U.S.-led coalition, and protecting civilians. \nThe talks come at a time of tension and mistrust between Russia and the West. \nAssad is Russia’s main ally in the Middle East, while France is firmly opposed to his rule. French air strikes are targeting Islamic State extremists as part of a U.S.-led coalition; Russia says it is targeting extremists too, but Western officials say Russia is using the air campaign as a pretext to go after anti-Assad rebels. \nThe two countries are not officially “coordinating” their air strikes but inform each other to avoid problems, the official said. The official was not authorised to be publicly named and spoke on condition of anonymity. \nRussia’s air strikes have prompted discussions in the Pentagon about whether the U.S. should use military force to protect U.S.-trained and equipped Syrian rebels if they come under fire by the Russians. The Pentagon on Thursday had its first conversation with Russian officials in an effort to avoid any unintended U.S. — Russian confrontations. \nIn the space of a few days, Russian air strikes in Syria and Mr. Putin’s diplomatic manoeuvring at the U.N. first raised hopes for a diplomatic breakthrough then brought fears of a new proxy war with the West. And they have suddenly overshadowed a Paris summit on Friday meant to focus on the conflict in Ukraine. \nRussian fighter jets have kept up a sustained rhythm of air strikes since Wednesday. They carried out 18 sorties in the past 24 hours, including 10 overnight in which seven sites were bombed, the Defence Ministry said on Friday. \nActivists say the Islamic State group did not hold Friday prayers in several mosques in its de facto capital of Raqqa in northern Syria, fearing Russian air strikes. The Britain-based Syrian Observatory for Human Rights said a drone carried out an air strike on an IS-run camp near Raqqa on Friday. It had no word on casualties. \nMr. Putin later met German Chancellor Angela Merkel, too. The European countries and the U.S. are all concerned about Islamic extremists who have seized territory and power in the chaos of Syria’s civil war and now threaten attacks abroad. \nBut Russia and the West don’t appear to be bombing Syria for all the same reasons. \nAllies in the U.S.-led coalition have called on Russia to immediately cease attacks on the Syrian opposition and to focus on fighting Islamic State militants. A joint statement by France, Turkey, the United States, Germany, Qatar, Saudi Arabia and Britain expressed concern that Russia’s actions will “only fuel more extremism and radicalization.” The statement, initiated by Turkish diplomats at the U.N. General Assembly, was released on Friday. \nRussian Foreign Minister Sergey Lavrov on Thursday rejected suggestions that the air strikes were meant to shore up Mr. Assad, Moscow’s main ally in the Middle East. \nMr. Lavrov insisted Russia was targeting the same militant groups as the U.S.-led coalition, which is conducting its own air strikes in Syria- the Islamic State, the al-Qaeda-linked Jabbat al-Nusra and other groups. \nThe Russian Defence Ministry statement on Friday said the latest wave of air strikes targeted only IS and destroyed a command post near Daret Azzeh in the Aleppo region and hit a field camp near Maaret al-Numan in the Idlib region, wiping out bunkers and weapons stores. \nThe Ministry released cockpit video of the bombing of the Kassert-Faradz command post and of two attacks in Maaret al-Numan. \nRussian jets appeared to be primarily bombing central and north-western Syria, strategic regions that are the gateway to Assad’s strongholds in the capital of Damascus and the coast. However given rapidly shifting battlefield terrain in Syria’s chaotic civil war, it can be difficult to distinguish which groups holds what territory. \nMr. Putin came to Friday’s meetings with the upper hand militarily. It’s a tactic he’s used in the past- Before major peace talks on Ukraine’s conflict in 2014 and earlier this year, Russia sent troops to bolster struggling separatists, weakening the Ukrainian government’s negotiating power. \nGermany has stayed out of the military action in Syria and pushed for a political solution. \nAhead of the Paris talks, Ms. Merkel stressed the importance of tackling the reasons hundreds of thousands of people are fleeing to Europe this year, and “that goes for Syria in particular.” \n“We have all known for years that there can only be a solution there with Russia, and not against Russia,” Ms. Merkel said on Thursday. \nMs. Merkel, Mr. Putin and Mr. Hollande met later Friday to discuss a political solution to Ukraine’s conflict, after a long-awaited weapons withdrawal agreement this week and some other signs of progress. \n"
}
