{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theatlantic.com/notes/2015/10/chinas-increasing-assertiveness/408661/",
    "language": "english",
    "text": "Over the last 10-15 years, China’s defense budget has increased several fold, bringing many new modern capabilities. Since 2006 China has increased the frequency and scope of naval patrols every year, incorporating their first aircraft carrier in recent years. The 2010 incident between China and Japan at the Senkaku Islands prompted China to start conducting regular civil maritime patrols at the islands, increasing the risk of another incident with Japan. In 2012, China asserted its presence at Scarborough Shoal after a dispute with the Philippines. Later in 2012, China dramatically increased patrols at the Senkaku Islands with civil maritime vessels and incorporated incursions into the contiguous zone and territorial waters of the islands. 2013 saw the consolidation of China’s civil maritime fleets in the China Coast Guard, the establishment of the East China Sea Air Defense Identification Zone, and the introduction of their first aircraft carrier into the fleet.\nThis activity is factual, but it could be seen as China merely catching up to the capabilities present in other countries in the region. Regardless, the activity does present a much more militarily confident and assertive China.\nChina’s land reclamation activities in the South China Sea are not necessarily a dramatic departure from policy, if one takes a long view of Chinese activity there as opportunistic. In the mid 1970s, China forcefully expelled Vietnam from the Paracel Islands during a violent conflict that was certainly more assertive than land reclamation. In the 1990s, the Philippines were forced out of Mischief Reef.\nIn these and other instances, China took the opportunity to assert itself and increase its presence in the South China Sea. Now that China has the capability and capacity to reclaim land at the islands, it should not necessarily be surprising that they would do so.\n1. As I noted in my International Security article, China’s coercive diplomacy in the South China Seas meets my definition of assertiveness. The building up of artificial islands is obviously new, and the militarization of the islands will give China the ability to impose more costs on other countries should frictions break into actual clashes or crises. Imposing more costs on other claimants for the same kind of behavior is consistent with my definition of assertive. So, yes, they are putting in place the capabilities to act even more assertively on maritime disputes should they choose to.\n2. I think one could argue that when it comes to cyber and in particular cyber-related commercial espionage China’s challenge to US interests meets my definition of assertiveness. But it also seems to be the case that cyber commercial espionage is a behavioral ‘norm’ for many states — China, Russia, France, Israel among others. In fact, US officials often claim that the US is alone among major economies in not engaging in commercial espionage. But this means, basically, they are acknowledging that US interest/policy is not the norm. This is why ‘naming and shaming’  China doesn’t seem to work in this area.\n3. Some pundits/commentary claim that, in addition to maritime disputes, China’s effort to build new institutions like the AIIB [the Asian Infrastructure Investment Bank] or the BRIC’s version of the IMF (the Contingent Reserve Arrangement) are examples of a new assertiveness because these allegedly challenge the US-dominated post-war economic order and Bretton Woods institutions like the World Bank and IMF. I think most experts on these institutions, people who have read, for instance, the conditionality for lending in the BRICs’ CRA, conclude that these institutions don’t fall outside of the boundaries of Bretton Woods’ standards. The CRA basically requires IMF conditions to cover 70% of borrowing from the fund. In fact, according to Peter Volberding, a PhD student here at Harvard, by far China’s largest lender is the China Development Bank and its ideas about conditionality are heavily influenced by the German development bank. This is not exactly evidence of a fundamental challenge to global capitalism.\n4. Whether or not China is becoming more assertive across more issue areas — political, social, trade, monetary, military, or environmental orders — is an empirical question. But anyone who claims that there has been a spread and/or intensification of assertiveness across Chinese foreign policy writ large should a) provide a definition of the term, b) develop reasonably rigorous indicators of such assertiveness, and then c) show change across time, across space (compared to other countries), and across issue area. Otherwise the debate becomes one of dueling anecdotes — here’s a case where China raised trade barriers vs. here’s a case where it lowered trade barriers; here’s a case where it is still abiding by an arms control commitment vs. here's a case where it's violated a commiment; here’s a case where the rule of law has deteriorated vs. here’s a case where the rule of law has been strengthened.\n5. One is beginning to hear people use the term ‘revisionist’, even ‘revolutionary’ to describe China’s approach to a wide range of issues, not just policy on maritime disputes, but orientation toward the so-called US-led liberal order.  This terminology is ahistorical. During the Mao period China tried to overthrow pro-US governments, advocated the spread of nuclear weapons, toyed with the idea of setting up a revolutionary United Nations, severely limited contact with the global capitalist economy, and pursued autarkic development policies. Now that was a revolutionary foreign policy.\n“The changes to kindergarten make me sick,” a veteran teacher in Arkansas recently admitted to me. “Think about what you did in first grade—that’s what my 5-year-old babies are expected to do.” \nThe difference between first grade and kindergarten may not seem like much, b ut what I remember about my first-grade experience in the mid-90s doesn’t match the kindergarten she described in her email: three and a half hours of daily literacy instruction, an hour and a half of daily math instruction, 20 minutes of daily “physical activity time” (officially banned from being called “recess”) and two 56-question standardized tests in literacy and math—on the fourth week of school.\nThis week, lawyers for Liberty Counsel and representatives from the Vatican confirmed that Pope Francis met with Kim Davis, the clerk of Rowan County, Kentucky, who has refused to perform same-sex marriages. It immediately became one of the biggest stories about the pope’s trip to the United States: A pontiff who has strained to change the Church’s tone on issues from abortion to homosexuality met with one of the most divisive figures in American politics.\nWhen Joss Whedon’s classic show Buffy the Vampire Slayer went off the air in 2003, its cult status was still very much nascent. Cue the novels, comics, video games, and spinoffs, not to mention fan sites, fan fiction, conventions, and inclusion on scores of “Best TV Shows of All Time” lists. But while it remains good fun to watch a seemingly ditzy teenager and her friends fight the forces of darkness with super-strength, magic, and witty banter, the show’s seven seasons have also become the subject of critical inquiry from a more intellectually rigorous fanbase: academics.\nBuffy, along with critically acclaimed series like The X-Files and Twin Peaks, came before The Sopranos and the beginning of the Golden Age of Television, but helped pave the way for scholars to treat television shows like The Wire, Mad Men, and Breaking Bad as sprawling works of art to be dissected and analyzed alongside the greatest works of literature. Academics have found Whedon’s cult classic to be particularly multi-dimensional—trading heavily on allegory, myth, and cultural references—while combining an inventive narrative structure with dynamic characters and social commentary.\nOne night in July—the night before her first day of work—a new doctor picked at a container of sushi in her apartment on a sleepy street in Brooklyn. She tried to swallow a few bites as she chatted on the phone with her best friend from medical school, who was also marking the eve of his first day as a working physician. “Break a leg,” she said. “But not really.”\nThere wasn’t any street noise to keep her up as she tried to go to sleep early for her 5:00 a.m. start—but even in the silence, heavy with midsummer humidity, she couldn’t drift off. For two months, since she’d graduated medical school, her body had registered her mounting stress leading up to her first day in the hospital. She was plagued by insomnia. Food made her nauseated, except plain donuts, which she ordered twice a day from the diner at the end of her block. She’d eat them while studying diagnoses and procedures that she’d learned in school and long since forgotten, crumbs piling up in the crease of her textbook. In the months between graduating and starting work, she lost more than 15 pounds.\nSomething strange is happening at America’s colleges and universities. A movement is arising, undirected and driven largely by students, to scrub campuses clean of words, ideas, and subjects that might cause discomfort or give offense. Last December, Jeannie Suk wrote in an online article for The New Yorker about law students asking her fellow professors at Harvard not to teach rape law—or, in one case, even use the word violate (as in “that violates the law”) lest it cause students distress. In February, Laura Kipnis, a professor at Northwestern University, wrote an essay in The Chronicle of Higher Education describing a new campus politics of sexual paranoia—and was then subjected to a long investigation after students who were offended by the article and by a tweet she’d sent filed Title IX complaints against her. In June, a professor protecting himself with a pseudonym wrote an essay for Vox describing how gingerly he now has to teach. “I’m a Liberal Professor, and My Liberal Students Terrify Me,” the headline said. A number of popular comedians, including Chris Rock, have stopped performing on college campuses (see Caitlin Flanagan’s article in this month’s issue). Jerry Seinfeld and Bill Maher have publicly condemned the oversensitivity of college students, saying too many of them can’t take a joke.\nWhen Susan Cain published Quiet: The Power of Introverts in a World That Can’t Stop Talking nearly four years ago, it was immediately met with acclaim. The book criticizes schools and other key institutions for primarily accommodating extroverts and such individuals’ “need for lots of stimulation.” Much to introverts’ relief, it also seeks to raise awareness about the personality type, particularly among those who’ve struggled to understand it.\n“The changes to kindergarten make me sick,” a veteran teacher in Arkansas recently admitted to me. “Think about what you did in first grade—that’s what my 5-year-old babies are expected to do.” \nThe difference between first grade and kindergarten may not seem like much, b ut what I remember about my first-grade experience in the mid-90s doesn’t match the kindergarten she described in her email: three and a half hours of daily literacy instruction, an hour and a half of daily math instruction, 20 minutes of daily “physical activity time” (officially banned from being called “recess”) and two 56-question standardized tests in literacy and math—on the fourth week of school.\nWhen Joss Whedon’s classic show Buffy the Vampire Slayer went off the air in 2003, its cult status was still very much nascent. Cue the novels, comics, video games, and spinoffs, not to mention fan sites, fan fiction, conventions, and inclusion on scores of “Best TV Shows of All Time” lists. But while it remains good fun to watch a seemingly ditzy teenager and her friends fight the forces of darkness with super-strength, magic, and witty banter, the show’s seven seasons have also become the subject of critical inquiry from a more intellectually rigorous fanbase: academics.\nOne night in July—the night before her first day of work—a new doctor picked at a container of sushi in her apartment on a sleepy street in Brooklyn. She tried to swallow a few bites as she chatted on the phone with her best friend from medical school, who was also marking the eve of his first day as a working physician. “Break a leg,” she said. “But not really.”\nThere wasn’t any street noise to keep her up as she tried to go to sleep early for her 5:00 a.m. start—but even in the silence, heavy with midsummer humidity, she couldn’t drift off. For two months, since she’d graduated medical school, her body had registered her mounting stress leading up to her first day in the hospital. She was plagued by insomnia. Food made her nauseated, except plain donuts, which she ordered twice a day from the diner at the end of her block. She’d eat them while studying diagnoses and procedures that she’d learned in school and long since forgotten, crumbs piling up in the crease of her textbook. In the months between graduating and starting work, she lost more than 15 pounds.\nSomething strange is happening at America’s colleges and universities. A movement is arising, undirected and driven largely by students, to scrub campuses clean of words, ideas, and subjects that might cause discomfort or give offense. Last December, Jeannie Suk wrote in an online article for The New Yorker about law students asking her fellow professors at Harvard not to teach rape law—or, in one case, even use the word violate (as in “that violates the law”) lest it cause students distress. In February, Laura Kipnis, a professor at Northwestern University, wrote an essay in The Chronicle of Higher Education describing a new campus politics of sexual paranoia—and was then subjected to a long investigation after students who were offended by the article and by a tweet she’d sent filed Title IX complaints against her. In June, a professor protecting himself with a pseudonym wrote an essay for Vox describing how gingerly he now has to teach. “I’m a Liberal Professor, and My Liberal Students Terrify Me,” the headline said. A number of popular comedians, including Chris Rock, have stopped performing on college campuses (see Caitlin Flanagan’s article in this month’s issue). Jerry Seinfeld and Bill Maher have publicly condemned the oversensitivity of college students, saying too many of them can’t take a joke.\nWhen Susan Cain published Quiet: The Power of Introverts in a World That Can’t Stop Talking nearly four years ago, it was immediately met with acclaim. The book criticizes schools and other key institutions for primarily accommodating extroverts and such individuals’ “need for lots of stimulation.” Much to introverts’ relief, it also seeks to raise awareness about the personality type, particularly among those who’ve struggled to understand it.\n"
}
