{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/2/9439077/patreon-hack-user-database-2-million-users",
    "language": "english",
    "text": "Crowdfunding site Patreon revealed earlier this week that it had recently been hacked, compromising the email addresses, usernames, and shipping addresses of its users. Since then, the hackers have dumped the data online, revealing the personal information of about 2.3 million users in the process.\nThe data was made available for anyone to download, and Troy Hunt, owner of haveibeenpwned.com, was able to extract the information and analyze the information in the file:\nSo far, the hackers, who identify themselves in a README file in the dump as the #SuperExtremeShitpostingTeam, haven't expressed any motive for the hack other than doing it for the lulz.\n\"We are being meticulous and rigorous in the investigation.\"\nIn a statement released to Motherboard, Patreon CEO Jack Conte said that the company is working closely with the authorities to reduce the risk for users. \"Patreon engineering has done a thorough analysis of the vulnerability that led to the breach,\" he writes. \"We are being meticulous and rigorous in the investigation, and based on conversations with dozens of advisors and security experts, I’m highly confident that we’re doing everything in our power to minimize the impact on our users.\"\nIn the meantime, Patreon members should change their email passwords immediately to avoid issues.\nIn order to provide our users with a better overall experience, we ask for more information from Facebook when using it to login so that we can learn more about our audience and provide you with the best possible experience. We do not store specific user data and the sharing of it is not required to login with Facebook.\n"
}
