{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.tech-otaku.com/local-server/configuring-virtual-hosts-xampp-mac-os-x/",
    "language": "english",
    "text": "A while back I posted about configuring virtual hosts in MAMP. More recently I noticed that MAMP hadn’t been updated in nearly a year and their support forum resembled a wilderness. Thinking that maybe the writing was on the wall for MAMP I started looking for an alternative and came across XAMPP.\nXAMPP provides a similar local server environment to MAMP, but configuring virtual hosts is a little different. Unlike the Pro version of MAMP , XAMPP doesn’t have a nice GUI to allow virtual hosts to be configured easily. So, there is no alternative but to do it manually.\nWith XAMPP we need to edit 3 files as opposed to only the 2 with MAMP. These are /etc/hosts, /Applications/XAMPP/xamppfiles/etc/httpd.conf and /Applications/XAMPP/xamppfiles/etc/extra/httpd-vhosts.conf. I’m assuming that you’ve not already added virtual hosts to the /etc/hosts file for a previous MAMP install.\nUpdate: A new version of MAMP (1.8) was released in September 2009.\n1. What You’ll Need\nThe /etc/hosts file is hidden and a standard or admin user doesn’t normally have write access to it. To edit this file you can open TextEdit with root privileges from a Terminal window like so. \nAn alternative is to use an editor like Smultron which has an option from the File menu to Open Hidden.. files and will ask for authentication if required. Smultron is free and whilst no longer under development works under 10.5.8.\n2. Example\nIn the example I’m going to configure a virtual host for a site that has a root folder of /Users/steve/Sites/MySite1/ and I’ll name the virtual host local.mysite1.\nEnsure you stop XAMPP’s Apache server before editing either of the files below.\n3. Editing the hosts File\nOpen the /etc/hosts file. You should see something like this:\nWe need to add a line to the end of this file for each virtual host we want to configure. The comment line is optional.\nThe file should now resemble this.\nSave and close the file.\n4. Editing XAMPP’s httpd.conf File\nOpen/Applications/XAMPP/xamppfiles/etc/httpd.conf. On or around line 468 you should see this.\nWe need to un-comment line 469 like so.\nSave and close the file.\n5. Editing XAMPP’s httpd-vhosts.conf File\nVirtual hosts in XAMPP are configured in the httpd-vhosts.conf file and not the usual httpd.conf file. So, open the file /Applications/XAMPP/xamppfiles/etc/extra/httpd-vhosts.conf. You should see this.\nEnsure that line 19 is un-commented and then add the following code block at the end of the file.\nNote that although I only want to configure a virtual host for local.mysite1, beginning on line 28 I’ve added a virtual host for localhost as the default named sever with the ServerName set to localhost and the DocumentRoot and <Directory> set to /Applications/XAMPP/htdocs. If you don’t, when you point your browser to http://localhost all you’ll see is the directory listing of the first virtual host, in this case local.mysite1, and not the XAMPP start page. You do not need to add a corresponding entry in /etc/hosts as this is included by default.\nFor the local.mysite1 configuration you can see that beginning on line 43 we are setting the ServerName to the name of virtual host we configured in the /etc/hosts file. The DocumentRoot and <Directory> are set to the site’s root folder.\nSave and close the file.\nTo ensure the virtual host has been configured correctly, restart XAMPP’s Apache server and point your browser to http://local.mysite1 \nI would recommend backing-up the /etc/hosts, /Applications/XAMPP/xamppfiles/etc/httpd.conf and /Applications/XAMPP/xamppfiles/etc/extra/httpd-vhosts.conf files whenever you make changes and store them on a separate drive or USB stick. If you later re-install the OS or XAMPP you’ll lose the changes to the respective files. This way you can easily restore your virtual host configuration.\n"
}
