{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/1/9422405/google-android-nexus-5x-6p-phones-ads",
    "language": "english",
    "text": "I've spent the past couple of days desperately trying to puzzle out the purpose behind Google's newly announced Nexus 5X and 6P smartphones. Unlike predecessors such as the Nexus One and Nexus 5, these phones don't have a clear reason for being, and are not in themselves terribly unique. That's led me (and others) to question Google's overall aim with the Nexus line of pure Android smartphones, and I think I've finally arrived at an answer. The Nexus program is not so much about carrier independence or purity of Android design as it is about presenting Google in an overwhelmingly positive light. In other words, Google, the ultimate ad seller, sells Nexus phones as ads for itself.\nFrom the very first Nexus device, Google has couched its self-branded smartphones in the language of benevolence and virtue. The original Nexus One in 2010 was Google's first effort at selling its own phones directly to consumers, and was thus the boldest attempt the United States had yet seen of circumventing the market dominance of mobile carriers. The Nexus S and Galaxy Nexus then served as valuable references for the best of Android at a time when Google's hardware partners were aggravating their users with awful Android skins and long delays on delivering updates. Since then, the Nexus 4 and the Nexus 5 — especially the Nexus 5 — have raised our expectations for what we can get from a good Android phone on a budget. I don't want to discount any of these achievements or pretend that there's no merit to them. There is. But they are tactics rather than a unifying strategy.\nDoing things for the fans is just good brand management\n\"We build hardware,\" says Google CEO Sundar Pichai, \"so that we can guide the ecosystem forward.\" Nexus phones are created in accordance with Google's development plans for Android, and that's a fair statement to make, but it doesn't explain why they're being released to the public. When we asked Google this week about the purpose of the Nexus sales program, the company told us that it's all about the fans. I believe that's absolutely the case, and Google is indeed one of the few companies to have both the whimsy and the resources to design and sell its own smartphones just because it can. But Google is also a publicly traded company and, as such, it's bound to act in a profit-seeking manner. The thing is, there's no conflict between doing things \"just for the fans\" and hoping to profit from that. It's just good brand management.\nGoogle, our knight in shining armor and a propeller hat, has come to save us from the evils of perfidious carriers, ugly Android skins, and late software updates. It's a great story to tell people, and it's being extended with the Project Fi cellular service, which is another Google venture designed to fix what the company believes is ailing the mobile market. Over the past couple of years, however — which have been characterized by the misfit Nexus 6 of 2014 and this year's pair of highly competent but otherwise unexceptional Android devices — the veneer of Google heroism has grown thin and Google's motivation has become better apparent. If Google truly wanted the Nexus phones to clean up Android or disrupt the carrier-driven sales model for smartphones, it would have sought much wider distribution for them by now. Instead, it seems content to just pump out a new Nexus model and sell a few phones every year and leave it at that.\nNexus devices are a headache for Google's Android partners\nIt almost seems innocuous, except that it's not. There isn't a single Android device manufacturer that is happy with the Nexus program, and I've spoken with them all. Those who build Nexuses for Google often do so reluctantly — with the possible exception of Huawei this year, whose US reputation stands to improve dramatically from the halo effect of being associated with Google by manufacturing the Nexus 6P. Still, neither Huawei nor LG, maker of the Nexus 5X, expects to make much direct profit from these new phones: they are priced aggressively and distributed narrowly, so there'll be little (if any) profit per device and few devices sold overall. Like Google, all a Nexus manufacturer can hope to gain is the benefit of indirect marketing and a better reputation among Android diehards.\nFor their meager sales each year, Nexus phones are disproportionately influential. This is the result of a positive loop between Google's high profile eliciting in-depth coverage (such as this very article) of the Nexus devices, which in turn — by being cheaper or purer than the rest — improve Google's standing among smartphone buyers. Every time there's been an antihero in mobile, Google has sought to throw up a Nexus against it. That's often come at the expense of Google's own Android partners, who are made to look foolish and sluggish by comparison. I don't think that's fair or particularly healthy for the Android ecosystem as a whole.\nNew Nexus phones have always raised expectations for Android devices, whether it be in terms of value for money or the cleanliness and responsiveness of the software on board. But new Nexus phones are also profitless love letters to fans, designed to induce goodwill for the Google brand. How can a company that depends on making money from each unit of hardware sold hope to compete with that?\nAndroid manufacturers have improved their ways, so why is Google still fighting them?\nMotorola went all-out with the Moto X Pure this year, seeking to deliver the cleanest possible Android experience, best possible specs, and lowest possible price, all while operating independently of carrier interference. That's as close to Google's Nexus ideal as any Android manufacturer has ever come. So if Google's Nexus motivation was truly to set a template of good practices to follow, to define a user experience benchmark, and to seed the development of a better Android ecosystem, it would have stopped and applauded Motorola for its efforts this year. Instead, Google is undercutting the $399 Moto X Pure with the $379 Nexus 5X, which has the added benefit of a fingerprint sensor and matches the Moto X with a highly rated camera capable of 4K video. I don't know whether to describe this as a knife in the back or an arrow to the knee, but Google's actions are certainly doing violence to its Android partners' best-laid plans.\nThere is no Android villain left for the Nexus crusader to slay\nGoogle's self-promotion is producing desirable devices, of that there is no doubt. But I don't feel like that's sufficient justification for Google to be getting into the already treacherous and unprofitable — for everyone but Samsung — Android smartphone market. In previous years, I'd have said the Nexus devices were necessary, vital even, in steering Android in a better direction and fighting the fragmentation of ugly, dysfunctional, and inchoate manufacturer software slapped on top. In 2015, however, Android phone makers have grown more conscientious and restrained. Their software and industrial design are more elegant than ever, and their pricing is as aggressive as it can be.\nThere is no Android villain left for the Nexus crusader to slay. The premium Nexus 6P and the value-for-money Nexus 5X are just diving into a crowded field without any mission for improving it — in fact, they're going to make everyone worse off by hastening the price erosion that is the bane of every Android device manufacturer's existence. This situation might look just dandy for us, the consumers, today, but I don't think we'll be happy if it leads to the extinction of companies like HTC or the exit from smartphone making by the likes of Sony.\nMaking Android profitable for Android phone makers is one of the great challenges of our time. We're all better off when we buy things from sustainable companies that we know will still be around when we have an issue months or years down the line. I wish Google would recognize that and try to do more to support Android as a whole rather than just its own good name. Nexus devices have in the past and can still serve nobler purposes than just making Google look good.\nVerge Video: Google Nexus 6P hands-on\n"
}
