{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.teslamotors.com/blog/your-autopilot-has-arrived",
    "language": "english",
    "text": "Tesla's commitment to developing and refining the technologies to enable self-driving capability is a core part of our mission. In October of last year we started equipping Model S with hardware to allow for the incremental introduction of self-driving technology: a forward radar, a forward-looking camera, 12 long-range ultrasonic sensors positioned to sense 16 feet around the car in every direction at all speeds, and a high-precision digitally-controlled electric assist braking system. Today's Tesla Version 7.0 software release allows those tools to deliver a range of new active safety and convenience features, designed to work in conjunction with the automated driving capabilities already offered in Model S. This combined suite of features represents the only fully integrated autopilot system involving four different feedback modules: camera, radar, ultrasonics, and GPS. These mutually reinforcing systems offer realtime data feedback from the Tesla fleet, ensuring that the system is continually learning and improving upon itself. Autopilot allows Model S to steer within a lane, change lanes with the simple tap of a turn signal, and manage speed by using active, traffic-aware cruise control. Digital control of motors, brakes, and steering helps avoid collisions from the front and sides, as well as preventing the car from wandering off the road. Your car can also scan for a parking space, alert you when one is available, and parallel park on command.\nTesla Autopilot relieves drivers of the most tedious and potentially dangerous aspects of road travel. We're building Autopilot to give you more confidence behind the wheel, increase your safety on the road, and make highway driving more enjoyable. While truly driverless cars are still a few years away, Tesla Autopilot functions like the systems that airplane pilots use when conditions are clear. The driver is still responsible for, and ultimately in control of, the car. What's more, you always have intuitive access to the information your car is using to inform its actions.\nThis release also features the most significant visual refresh yet of the digital displays for every single Model S around the world. The Instrument Panel is focused on the driver and includes more functional apps to help monitor your ride.\nThe release of Tesla Version 7.0 software is the next step for Tesla Autopilot. We will continue to develop new capabilities and deliver them through over-the-air software updates, keeping our customers at the forefront of driving technology in the years ahead.\n"
}
