{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/6/9461209/steve-jobs-movie-review-aaron-sorkin-danny-boyle-michael-fassbender",
    "language": "english",
    "text": "The single most poignant moment in Steve Jobs, Aaron Sorkin’s long-awaited study of the adored Apple founder, is perhaps its simplest: Jobs (Michael Fassbender), triumphant as the reinstated CEO of Apple and minutes away from debut of the iMac, confesses to his 19-year-old daughter Lisa that he’s imperfect. “I’m poorly made,” he says, a look of contrition on his face. It’s a powerful line, one that cuts not only to the heart of a man so carefully and brutally dissected over the course of two hours, but also to the myth Jobs took great pains to uphold.\nWritten by Sorkin and directed by Danny Boyle, Steve Jobs comes as that myth — Jobs as a great man whose unassailable vision helped guide the world into the 21st century — is being reappraised, if not torn down outright. He was brilliant, yes, but he could be heartless to both colleagues and even family. It’s a common vision, authoritatively established in Walter Isaacson’s 2011 biography (which this film very loosely adapts) and expanded upon in Alex Gibney’s recent documentary Steve Jobs: The Man in the Machine. But Steve Jobs approaches its subject and his legend with a laser focus, allowing its fictive Jobs to own both his genius and uncompromising cruelty. It’s a tough balancing act weighing the man’s many warts against his beloved public persona, and the film can never quite get out from under the hero worship Jobs so easily elicits. But Steve Jobs mostly succeeds, crafting a human portrait of a tech leader who struggled behind the scenes to be greater than his failings.\nIt would be a stretch to call Steve Jobs a biopic in any traditional sense, as it never delves deeply into Jobs’ life. Instead, Sorkin divides the film into three acts, focusing on a trio of pivotal product launches from Jobs’ career — namely, the Macintosh in 1984, the NeXT Computer in 1988, and the iMac in 1998. Cleaving to this structure lets the The West Wing writer do what he does best: write electric dialogue for actors walking up and down hallways. Each scene involves the problem of getting a product launch off the ground, with Jobs and his indefatigable right hand Joanna Hoffman (Kate Winslet) contending with venue logistics, malfunctioning hardware, and an inner circle that Jobs can’t help but alienate, all in the name of moving mankind forward.\nMake no mistake: this is unquestionably a Sorkin film, featuring everything from the ping-ponging dialogue to the almost-romance between the male and female leads. The script flies along at a terrifically engaging pace, capturing the spirit of a tech launch — the high anxiety, the frayed nerves — beautifully, landing somewhere between The Social Network and Birdman. And under Boyle’s stylish direction, what might otherwise be a stage play turns into a visual tour de force, flitting from grainy 16mm in 1984 to theatrical 35mm and hyper-polished HD with each passing era. Keep in mind that the movie doesn’t concern itself too heavily with the factual particulars of the products being launched. (Probably ideal, since Isaacson got so much about Jobs’ actual work wrong.) Instead, the beauty of Steve Jobs is that it uses computers as catalysts, enabling Sorkin to bend Jobsian lore to his will and set off fireworks between his characters.\nMichael Fassbender, center stage as the late CEO, is dazzling here — no small feat considering he looks nothing like the man. Where Ashton Kutcher’s 2013 take on Jobs amounted to just a wrathful genius, Fassbender’s is layered and nuanced, more convincingly full of the contradictions that now define Jobs in the public mind. In one early scene, Fassbender slides from envisioning himself standing shoulder to shoulder with Russian composer Igor Stravinsky to cooly denying his fatherhood in front of his five-year-old daughter. Seeing that contrast is jarring, almost horrifying, but Fassbender pulls it off effortlessly. And Fassbender isn’t alone: Winslet manages to overcome a dodgy Polish accent to put in a powerhouse performance as Jobs’ \"work wife\" Hoffman; Jeff Daniels oozes fatherly wisdom as former Apple head John Sculley; and even Seth Rogen gives a solid turn as wounded and underappreciated Apple co-founder Steve Wozniak. Each is as close as family in Jobs’ life, and each takes shrapnel from him in his all-consuming pursuit of excellence.\nBut it’s Lisa Brennan-Jobs, played at different ages by Makenzie Moss, Ripley Sobo, and Perla Haney-Jardine, who provides the emotional throughline for the entire movie, clearing a path for Jobs’ redemption. While she’s not at all the hero Sorkin hinted she would be in the run-up to the film’s release — she’d have to be onscreen at least as much as her father to pull that off — Lisa is very much the moral center of the film. She’s Steve’s mirror image, a precociously intelligent kid with much of his potential but none of his brokenness. Rather than being cruel, she’s kind. Rather than being indifferent to the feelings of others, she’s empathetic. And because she can see right through him, she allows Jobs to see past his own failings and finally be a little bit better than just a tech visionary.\nAnd that seems to be the point. Steve Jobs never argues that Jobs was anything less than a great man. As a matter of fact, Sorkin’s love of great flawed men may shine through too well here, since it’s never that difficult to root for Jobs even at his worst. But the movie holds human connection in higher regard than technological progress, and for all the time Jobs spends trying to lead through art, design, and the revolutions he helped spearhead, he seldom looks behind to connect with the people he leads. By saying, \"I’m poorly made,\" Jobs confesses that he understands that fundamental flaw; that perhaps all his achievements were borne out of his need to escape his own weaknesses.\n  'Steve Jobs' never argues that Jobs was anything less than a great, if deeply flawed, man  \nThe film ends with the CEO, having just unveiled the iMac, fading into a sea of camera flashes and thunderous applause. The iPod is on the horizon, a new revolution waiting to happen. In Sorkin’s world, Jobs will create the iPod as a tribute to Lisa instead of for his own personal glory. In truth, we know the iPod was never designed by Jobs alone for any one person. For me, though, that act encapsulates the breakdown of the Jobs myth and the creation of a new one. For two hours, I’d seen Steve Jobs cut down to size, and here he’s built back up into what might hopefully be a good man. It’s the ending Sorkin wants, and I found I wanted it, too — an ending where this irretrievably imperfect man’s only way to show love was to change the world all over again. In the real world, Apple followers may still wrestle with Jobs’ contradictions, struggling to reconcile the great with the less-than-good. That reconciliation may be a long way off. Here, at least, he’s just a gifted human being. And when it all fades to black, it feels like that’s enough.\n"
}
