{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/10/31/technology/us-tech-giants-may-blur-national-security-boundaries-in-china-deals.html?ribbon-ad-idx=5&_r=0",
    "language": "english",
    "text": "HONG KONG —  One Chinese technology company receives crucial technical guidance from a former People’s Liberation Army rear admiral. Another company developed the electronics on China’s first atomic bomb. A third sells technology to China’s air-to-air missile research academy.\nTheir ties to the Chinese military run deep, and they all have something else in common: Each Chinese company counts one of America’s tech giants — IBM, Cisco Systems or Microsoft — as a partner.\nSuch links, which are generally not well publicized, are now at the center of a debate among some in the American defense community, including former United States military officials, analysts and others. While the cross-border partnerships, under which American tech companies share, license or jointly develop advanced technologies with Chinese counterparts, are a growth area for business, security experts are increasingly questioning whether the deals harm United States national security.\nWhile the capabilities shared in the partnerships are commercial in nature, such technologies have also become more critical to defense. That is spurring concerns that widespread cooperation with Chinese companies could quickly increase China’s fundamental technological capabilities in a way that could easily help military research and operations.\nA report made public this week from a security firm with longstanding ties to the Department of Defense, the Defense Group Inc., said IBM’s partnerships in China, which are part of a global initiative that the company calls Open Power, are already damaging American national security.\n“IBM is endangering the national and economic security of the United States, risking the cybersecurity of their customers globally, and undermining decades of U.S. nonproliferation policies regarding high-performance computing,” the report said.\nEdward Barbini, an IBM spokesman, rejected the report’s conclusions, saying Defense Group Inc. “wholly mischaracterizes IBM’s initiatives in China.”\nBut other security experts defended the study by the firm, which was founded in 1987 by a former Defense Department official, James P. Wade, who was one of the authors of the military doctrine known as “shock and awe.” Defense Group Inc. is known to be tough on China but is used by the government to produce classified military analysis and intelligence, and works with groups including the U.S.-China Economic and Security Review Commission, which examines the national security implications of trade between the United States and China.\nThe Defense Department did not respond to requests for comment on the report.\n“We need to pay more attention to the judgments on whether advanced technology should be sold,” said Adm. Dennis C. Blair, who was the United States director of national intelligence from 2009 to 2010 and who headed the Pacific Command. “If you don’t pay attention, you can have damage to your national security.”\nAdmiral Blair said the United States government operates on the principle that companies should be able to sell technology that is generally available on the world market but that they should be prohibited from selling advanced technology that can be put to military use. Government agencies in charge of foreign acquisition of technology need to be strengthened, he said.\nThe Department of Defense did not immediately return a request for comment.\nThere is nothing to suggest that the partnerships have broken American laws. With IBM’s program, many elements have been vetted and approved by the United States government, which is empowered through a review process to decide whether American tech companies are giving away too much advantage to military rivals.\nStill, the reviews have resulted in two decisions this year that commercial technology could threaten national security. In February, the Department of Commerce said that four supercomputer sites in China receiving chips from Intel through its Chinese partner, Inspur, “have been involved in activities contrary to the national security and foreign policy interests of the United States.” Intel has said it stopped selling the chips in China and that it was in compliance with United States law.\nIn May, the United States Navy also said that it needed new server computers for one of its systems after the server provider, IBM, sold the computing unit to the Chinese company Lenovo. IBM said the sale had passed the United States government’s review.\nThe issue is tricky because cooperation between American companies and Chinese ones allied with the military is a natural outgrowth of globalization. Any policies that limit American companies’ work on commercial technologies with Chinese partners could damage their competitiveness, analysts said.\n“It’s so difficult to keep tech away from China commercially given how large China’s market is,” said Scott Kennedy, an analyst at the Center for Strategic and International Studies.\nIBM and other American tech companies said they are not harming national security through the partnerships, they follow United States laws carefully and they treat the endeavors the same as for any commercial venture in a foreign country.\nMr. Barbini, the IBM spokesman, said the Open Power program was not specific to China, and the technology provided through it “is commercially available, general purpose, and does not require a U.S. export license.”\nHe added that “all IBM sales and technology licensing agreements comply with U.S. export regulations and require that partners in any country do so as well.”\nMicrosoft has said it is handling its partnership with a Chinese government-owned defense company as it would other system integrators globally. A Cisco spokesman said technology developed in a new Chinese partnership would be done with approval from the American and Chinese governments.\nWhile American tech companies have long worked with the Chinese government, Beijing has over the last two years pushed companies for tighter relationships, like joint ventures and agreements to transfer technology, with Chinese companies. Chinese officials have used the carrot of market access to spur more American corporate collaboration.\nThat has led to a rising number of partnerships. IBM began working with Chinese companies including CCore, Beijing Teamsun Technology and Inspur. Each Chinese company works to develop advanced technology for the government and sells to military clients, according to information on their websites and other public sources.\nLast month, during a visit by China’s president, Xi Jinping,  to the United States, Cisco also announced a joint venture with Inspur, a server maker that counts China’s air-to-air missile research academy as a client. Microsoft unveiled a partnership with the China Electronics Technology Group Corporation, or C.E.T.C., a government-owned defense company overseeing the former military-run research institutes that developed the electronics for China’s first nuclear bomb.\nOther American tech companies have signed similar deals. Intel took a stake last year in a subsidiary of Tsinghua Holdings, China’s emerging microchip national champion. Hewlett-Packard sold a majority stake in its Chinese networking unit to a separate subsidiary of Tsinghua this year, and Dell said it would spend $125 billion in China through 2020.\nInspur, C.E.T.C., Tsinghua and CCore did not respond to requests for comment. Intel, H.P. and Dell declined to comment.\n“The Chinese companies are required to do the best for their government. American companies say they are only answerable to their shareholders,” said James McGregor, chairman of the greater China region of the consulting firm Apco Worldwide. “So who is looking out for the United States?”\nThe report on IBM last month from Defense Group Inc., which provides intelligence to the United States government and private clients that pay for the research, said Big Blue had gone too far with its Chinese collaborations. The report, using publicly available information, chronicled the military ties of the Chinese beneficiaries of IBM’s program, through which IBM licenses intellectual property for microchips, servers and software to partners.\nIn one case, the report said, a former Chinese rear admiral, Shen Changxiang, who is also a member of a Communist Party committee on the Internet headed by Mr. Xi, oversees the integration of IBM’s technology at one of the partners, Teamsun.\nAnother partner, CCore, provides specialized microchips for weapons control, the report said. Inspur, also a partner, sells products to the Chinese military, including a rugged hand-held computer and messaging software, said the report, which is titled “Open Power, Hidden Dangers: IBM Partnerships in China.”\nDefense Group Inc. declined to say if the report was made at the request of a private client or a government group. The firm said that as a matter of policy, it does not reveal its funding sources; it declined to say why.\n“The information in the report is a matter of public record and the analysis is our own,” the firm said in a statement. “Regardless of sources of our funding, it’s absolutely critical for our reputation to always be unbiased in our reports.”\nAdmiral Blair said it was “useful to have a check” and have the report spotlight IBM’s initiative. Defense Group Inc., with an intelligence unit headed by James Mulvenon, a former researcher at the RAND Corporation, has a staff that includes linguists and digital experts with American government security clearances, he said.\nWhile Defense Group Inc.’s report focuses on IBM, analysts said a blurring of the lines among many companies that supply military and commercial technology makes it difficult to know what cooperation might result in technology ultimately being used by China’s military.\n“We’ve seen major efforts in China to push the boundaries of civil-military integration, so this does make it increasingly difficult to work out what’s military and what’s commercial,” said Tai Ming Cheung, a professor at the University of California, San Diego, who specializes in Chinese defense issues.\n"
}
