{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.atpworldtour.com/en/news/federer-battles-nadal-for-basel-2015-title",
    "language": "english",
    "text": "Roger Federer ended a three-and-a-half year drought against Rafael Nadal on Sunday at the Swiss Indoors Basel, claiming a seventh title in his hometown 6-3, 5-7, 6-3.\nAfter a 21-month wait, Federer and Nadal renewed their storied rivalry on the indoor hard courts of the ATP World Tour 500 event, with the Swiss winning for the first time since the 2012 BNP Paribas Open in Indian Wells. Competing in a record 12th final on home soil in Basel, he added a seventh trophy, a feat he has also achieved at four other tournaments in his career (Wimbledon, Halle, Dubai, Cincinnati).\nNadal was looking to make early inroads in the Federer serve and the Spaniard would attack early behind a barrage of deep, penetrating groundstrokes. Federer was forced to save a break point in his first service game following a trio of errors, but the Swiss would quickly regain his composure. The home favourite claimed six of the next seven points and rode the wave of momentum to three break chances of his own at 2-2. Utilising the fast indoor conditions at the St. Jakobshalle to his advantage, Federer opened the court and refused to give Nadal time to set up his forehand, coming forward often, as he has done all year.\nOne of the points of the tournament came with Federer facing break point in the sixth game. Nadal had the Basel native on the ropes after ripping a backhand approach into the open court, but Federer turned defence into offence in a flash, lunging at a cross-court forehand from well behind the baseline and sneaking it just past Nadal for the stunning winner. He would not look back, breaking to love a few games later to capture the opener 6-3.\nFederer made a push to run away with the match early in the second set, but Nadal would not go down quietly, saving a break point while serving down 2-3. The margins were razor thin as both players looked to attack with first-strike tennis. The Mallorca native was one step ahead of the top seed in the latter stages of the set and his aggressive mindset would pay dividends, claiming his first break of the match for 6-5 as Federer buried a forehand into the net. Nadal would force a decider with a hold to love.\nThe patterns of play from the first two sets persisted in the third, with both players looking to open the court and keep rallies short. A Nadal double fault in the third game would give Federer a break chance to claim a potentially decisive break, but the Spaniard dispelled any such notion. He would win the battle, but the Swiss would win the war, grabbing the decisive break for 5-3 and serving it out a game later after two hours and three minutes on court. The former Basel ballboy out-aced Nadal 12-0 and struck 44 total winners. He converted on three of seven break points.\nFederer earned his third title this year at an ATP World Tour 500 event, adding to crowns in Dubai and Halle, and 88th of his career at the tour-level. He also emerged victorious in Brisbane, Istanbul and Cincinnati in 2015. Nadal, meanwhile, who owns a 23-11 FedEx ATP Head2Head edge, was vying for just his second indoor hard court trophy (Madrid 2005).\n"
}
