{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/11/01/world/middleeast/russian-plane-crashes-in-egypt-sinai-peninsula.html?mabReward=A1&_r=0",
    "language": "english",
    "text": "MOSCOW —  A Russian charter flight ferrying 224 passengers and crew to St. Petersburg from the Red Sea resort of Sharm el-Sheikh, Egypt, crashed soon after taking off early Saturday, killing everyone onboard, officials in Egypt and Russia said.\nThe plane, an 18-year-old Airbus A321-200, disappeared from radar screens about 25 minutes after it took off, according to official accounts. Hossam Kamal, the Egyptian transportation minister, denied that anything abnormal had happened before the plane disappeared. Earlier news reports in Egypt, citing officials, said the pilot had radioed that he was having technical difficulties and wanted to make an emergency landing.\n“Communications between the pilot and the tower were very normal — no distress signals occurred,” Mr. Kamal said at a news conference broadcast nationally. The pilot did not request to change his route to make an emergency landing, he said, emphasizing that “all was normal; the plane disappeared suddenly off the radar without any prior warning.”\nThe Egyptian government sent military crews and 50 ambulances to the crash site in an area called Hasana, a mountainous region about 46 miles south of El-Arish, the main city in the part of the Sinai Peninsula where the crash occurred. The ambulances began taking the 129 bodies recovered to military helicopters, senior officials said. All 224 people onboard the plane died, the Russian Embassy in Cairo said in a brief statement on Twitter.\nHours after the crash, a branch of the Islamic State operating in Sinai claimed responsibility. There has been no indication that the branch has the kind of weapons needed to bring down a plane from a high altitude. The other possibility would be a bomb planted or carried onboard. There has been a violent insurgency in Sinai against the Egyptian government for several years.\nEgyptian and Russian officials did not immediately confirm the cause of the crash. The plane had apparently been trying to land at the airport at El-Arish, in northern Sinai, when it crashed, spreading mangled wreckage over a wide area of desert.\nMaxim Sokolov, the Russian transportation minister, issued a statement rejecting reports that the plane had been the target of a terrorist attack.\n“This information cannot be considered credible,” Mr. Sokolov said. “We are in a close contact with our Egyptian colleagues, with the aviation authorities of this country. At the moment, they have no information that would confirm such fabrications.”\nAir France and Lufthansa said Saturday that they would avoid flying over the Sinai Peninsula as a precaution until further notice. Lufthansa said this would involve rerouting flights to six destinations.\nThe plane was flying at 31,000 feet when it suddenly began to descend. The general range of the shoulder-fired missiles, commonly known as Manpads, that have been used against Egyptian military helicopters in the region is much lower, around 20,000 feet.\nRussian officials emphasized that determining the cause of the crash would require a technical analysis of the flight recorders and other work. Investigators from both Russia and France will assist.\nNews reports in Egypt quoted the first security officials who reached the site as saying that the plane had broken in two and that many of the passengers were still strapped into their seats.\nSherif Ismail, the Egyptian prime minister, said at a news conference that the flight recorder had been recovered, along with the bodies of 129 victims. Debris from the crash was spread over an area of at least four miles, he said, and the security services continued to comb it.\nTelevision footage showed ambulances backing up to a brown military transport helicopter and wrapped corpses being put on board.\nAn Egyptian government statement said the plane had been carrying 217 passengers, including 17 children, and seven crew members. Everyone onboard was Russian, most from the St. Petersburg region, except for three passengers from Ukraine and one from Belarus.\nThe plane, Metrojet Flight 7K9268, left the airport in Sharm el-Sheikh shortly before 6 a.m. and disappeared from radar screens at 6:20 a.m.\nA website called Flightradar24, which tracks air traffic around the globe, said the plane had been descending at a rate of 6,000 feet per minute just before it disappeared from radar.\nIn St. Petersburg, friends and relatives who showed up at Pulkovo Airport to meet the flight were shuttled to the nearby Crowne Plaza hotel. They remained cordoned off in a corner of the lobby, awaiting developments. A Russian Orthodox priest and at least one grief counselor circled among them.\nNina, an elderly woman who gave only her first name, said she was waiting to give a sample of her DNA, requested from all the relatives to help identify the victims. “I saw the news on television, so I came,” she said. Her son Alexei, 45, and his fiancée, Natasha, had been vacationing in Egypt.\nPresident Vladimir V. Putin of Russia ordered the establishment of a state commission to investigate the crash. The Russian government also sent a plane from its emergency services to take a team of investigators to the scene.\nMr. Putin declared Sunday a day of mourning for the victims. Russian news reports said the crash was the worst aviation disaster in Russian history.\nA criminal investigation began with searches of the airline’s offices to make sure the plane was in compliance with Russian safety standards, according to a statement on the website of the Investigative Committee, the main government agency for criminal inquiries.\nThe plane was operated by Kogalymavia, which is privately owned and flies planes under the name Metrojet. There was nothing remarkable about the airline’s safety record, though the fuel tank on one of its planes exploded before departure from the Siberian city of Surgut in 2011, and the ensuing fire killed three people.\nThe airline issued a statement saying that the plane had been in good working order and in the hands of experienced pilots.\n“In 2014, the airplane has undergone factory maintenance in accordance with the factory specifications,” the statement said. “All requirements of preflight technical maintenance were fulfilled in full and on time.”\nRussian news reports quoted unidentified sources as saying that the crew had recently complained about problems with one of the two engines on the plane that crashed, but there was no official confirmation.\nThe sharp drop in the value of the ruble and tensions with the West over the past year have sharply diminished the number of Russians traveling abroad. But Egypt remained the No. 1 tourist destination for Russians leaving the country in the first six months of 2015, with more than a million Russians vacationing there, according to the Russian federal agency for tourism. A basic package tour including a flight, hotel and meals can be had for as little as $500 or $600 a week.\nApart from coastal resorts in the south, much of the Sinai Peninsula is a closed military zone, with a long-running insurgency by jihadist groups against the government of President Abdel Fattah el-Sisi.\nIn the claim of responsibility, which the SITE Intelligence Group said was issued by the Sinai Province of the Islamic State, the terrorists indicated that they had shot the plane down in retaliation for Russia’s military actions in Syria.\nGenerally, analysts have noted that the Islamic State does not issue official statements for attacks it has not carried out. That is less true for its followers, however. “Soldiers of the Caliphate were able to down a Russian airplane over Sinai province,” the statement said. “It was carrying on board more than 220 Russian crusaders. O Russians and whoever is allied with you, know that you neither have safety in the lands of Muslims nor in the air, and that killing dozens every day” in Syria “by the bombardment of your aircraft will bring calamity on you.”\nIt is unclear what weapon systems the Sinai branch of the Islamic State has. French officials and weapons manuals recovered in Mali confirmed in 2013 that Al Qaeda’s branch in North Africa possessed SA-7a and SA-7b surface-to-air missiles, which are capable of shooting down a commercial plane during takeoff and landing but do not have the range to hit an aircraft at high altitude.\nMembers of Al Qaeda’s branch in Africa have defected to the Islamic State, but it is unclear if they brought weapons with them.\nThe Sinai branch of the Islamic State has displayed the capability to shoot down an aircraft on at least one occasion. In January 2014, when the group was known as Ansar Beit al-Maqdis and had not yet linked itself to the Islamic State, the militants used a Manpad portable missile launcher to take down an Egyptian military helicopter. This summer, the group also hit an Egyptian naval vessel in the Mediterranean with a guided missile.\n"
}
