{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://timesofindia.indiatimes.com/india/Air-travel-to-cost-more-as-govt-plans-2-cess/articleshow/49602928.cms",
    "language": "english",
    "text": " Fares for flights to and between small towns — that can be enabled by reviving almost 400 unused airstrips across India as budget airports — will be restricted at Rs 2,500 per hour. This will be done by keeping airlines' cost of operation low and giving them direct subsidy from the regional connectivity fund (RCF) that comes from the 2% cess. \n Acting on Prime Minister Narendra Modi's directive to make flying an affordable mode of travel for the common man, the aviation ministry on Friday released a draft aviation policy which aims to ensure that at least one member of India's 30-crore strong middle class families flies once a year — up from the present 7 crore domestic flyers in a year. The cess will, however, make it a little more expensive for a majority of Indians to fly between big cities.\n The draft also talks of raising the 49% FDI cap in Indian airlines to over 50% in next five to six years by when India would have open skies with most other countries on a reciprocal basis. Open skies means no restriction on the number of flights airlines of either country can operate in the other. \n While the draft policy — which is completely silent on Air India, Indian aviation's biggest question mark — says that the regional connectivity scheme (RCS) will come into force from April 1, 2016, the government will notify when the 2% cess of tickets will be charged from as that may kick in earlier too. \n \"The PM asked us to ensure aviation is no longer elitist and in reach of the common man across the country. India has 476 airstrips or airports of which only 75 have regular flights. They can be developed as low cost airport at a cost of Rs 50 crore each. To ensure airlines find it viable to operate small planes (up to 100-seaters) to these hitherto unused places, both the centre and state governments will give tax rebates apart from services at concessional rates,\" said aviation secretary R N Choubey, the architect of the draft policy. \n If there is a still a gap in the cost of operations and the Rs 2,500 hourly fare cap, the government will give airlines direct subsidy from the Rs 1,500 crore it expects to raise as RCF annually. Since not many Indian carriers have shown the inclination to buy small planes, the ministry has proposed a new category of airlines — scheduled commercial airlines that can operate with a paid-up capital of Rs 2 crore and have a fleet of sub 100-seater aircraft. They will have to pay no airport charges at airports that come under regional connectivity scheme and get lower charges at other airports. \n Reacting to the 2% cess, IndiGo president Aditya Ghosh told reporters: \"Seen in isolation, fares will rise. At the same time, if the money collected from cess is invested back in the airport infrastructure like air traffic management and ground handling, then we will definitely see fares coming down.\" \n"
}
