{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://publiceditor.blogs.nytimes.com/2015/10/29/conflict-of-interest-in-t-magazines-tech-article/?_r=1",
    "language": "english",
    "text": "A recent article in T, the style magazine of The Times, celebrated entrepreneurs “harnessing goodness through technology.” The article, headlined “The Transformers” in print, was written by Laura Arrillaga-Andreessen, who is not a Times staffer.\nRosalind Paaswell of New York City was one of many who wrote to me about it, questioning an apparent conflict of interest in the section about Brian Chesky, the chief executive of Airbnb.\nMy question is about an undisclosed conflict: Ms. Arrillaga-Andreessen is the wife of Marc Andreessen, a substantial investor in Airbnb. Since the article reads as uncritical P.R. for the company, should readers have not been informed of this connection? I don’t know what Mr. Andreessen’s holdings in Airbnb are currently, but there is a definite connection that all should have known. The article mentions briefly that the business is being contested by “the hotel industry” spending “millions to combat” it – the big, bad hotel industry, of course. It is clever of Mr. Chesky to frame himself as the target of a big, bad corporation, ignoring other legitimate criticisms. But good journalism would not have left it at that.\nIn other words, the author of the article is not only married to a major player in the tech world, but one who is a major investor in one of the companies she featured. As Ms. Paaswell wrote, there was no disclosure.\nThe larger question is whether Ms. Arrillaga-Andreessen should have been chosen to write the article at all, given this conflict.\nI asked T’s editor, Deborah Needleman, to respond. She wrote:\nI disagree that we shouldn’t have let Laura write, as she is a separate person from her husband with her own career and credentials, having created a program for philanthropic study at Stanford. I sought out her opinion for those reasons, but agree that we should have had a disclosure, and it was my mistake in not asking her if there were any potential conflicts. This was an oversight on my part. I say this not as an excuse, but she is, separately from her husband, a billionaire (making her through marriage a billionaire twice over) and for that reason I think I failed to consider any monetary conflict in her case. Had I done that, I would have thought twice about the Airbnb mention, but as I believe in her expertise and opinion, might still have wanted to run it, but absolutely would have included a disclosure.\nAs TechCrunch reported in 2011, Mr. Andreessen’s firm led a $112 million investment in Airbnb. And Business Insider in May described his impact on the growth of new companies: “One of those companies is $10 billion Airbnb, which was still a bumbling startup when Andreessen led its Series B round.”\nMy take: This is a case in which the financial conflict is so clear, and the spousal tie so close, that a disclosure would not have been enough. A different writer altogether would have been a far better idea, and, to my mind, the only right one.\nWhat’s more, the article was extremely favorable to these “most visionary entrepreneurs.” In fact, one of them, Elizabeth Holmes, was also hailed as one of “The Greats” in the same issue. (She, along with Jonathan Franzen and Quentin Tarantino, among others, was described in a headline as “Greatness, Personified.”) In contrast, only days later, Ms. Holmes was the subject of a tough-minded Wall Street Journal investigation into the serious problems of her company, Theranos. That kind of exposé is not T’s mission, of course, but the magazine is still part of The Times’s journalistic offerings, and should live by the same standards.\nOnline, the article now carries a disclosure about Mr. Andreessen and a link to news coverage of Theranos, and an editors’ note has appeared in print.\n"
}
