{
    "status": "OK",
    "warningMessage": "truncated-oversized-html-content",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theguardian.com/football/live/2015/nov/01/everton-v-sunderland-premier-league-live",
    "language": "english",
    "text": "So Arouna Koné takes the match ball after his hat-trick but the man-of-the-match could have equally have gone to Gerard Deulofeu, who scored one and provided two assists. From Howard to Lukaku, Everton were excellent, although for large parts of that match, they didn’t have to be: Sunderland were woeful. Allardyce gambled playing a 3-5-2 and it backfired dramatically, his team lacked a leader when Cattermole went off injured, lacked shape defensively and didn’t take enough of their many chances going forward. After last week’s celebrations, Sunderland supporters have been brought back down to earth with a bump. They remain second bottom.\nThanks for reading and for your emails and tweets. See you next time. Bye!\n“Whoa ... hold on there ... articulate footballers?” emails Mats Anderson. “Lilian Thuram must be No1. Or at least thereabouts. Silky skills alloyed with steel. Foot wise and mouth/mind wise.”\n89 min: Watmore gets clear through on goal, but tries to lift the ball over Howard, who simply stands tall and palms the ball away. For all their defensive woes, Sunderland have had lots of chances to score today. A moment later, Howard makes two more saves, with Defoe and Larsson both trying their luck. After a poor performance last week, Howard has been excellent.\n82 min: Watmore gets to the byline, and sneaks past Stones but the angle is too tight for the former non-league player to turn it in. Instead the ball breaks across the six yard box, where Larsson is waiting, but McCarthy makes a brave last-ditch tackle, and Barkley, on his goal-line, is able to bring the ball away.\n80 min: “Hey Michael,” writes JR in Illinois. “Maybe Martinez took Deulofeu off because he was concerned about having to play short-handed. The way Deulofeu plays he was likely to get booked for diving again. The guy is obviously super talented but he really needs to cool it with the diving. He threw himself down numerous times against Arsenal last week.”\nHat-trick for Kone! Of the eight that have been scored today, there have been some great goals, but some better assists. This is the pick of the bunch: Lukaku curling an exquisite cross with the outside of this foot into the gaping corridor between Brown and Pantilimon, who is stranded on his line. Kone simply has to connect from five yards, and he does does so: nodding into the corner. Kone takes a knee and does the shoe-shining celebration on Lukaku. WHAT A CROSS. Best of the season.\nWell that’s that then. Every time Sunderland lose the ball, they are over-committed. Stones gets a toe in on M’Vila and Everton break at pace in numbers: Barkley carrying the ball 50 yards without a tackle, before slipping in McCarthy, who was haring up alongside him. The pass is slightly behind the Irishman, but he sends a wonderfully disguised reverse pass to Kone, who lifts the ball over the onrushing Pantilimon from an acute angle. Great finish.\n51 min: Stones is caught out of position and Sunderland sweep forward again. Defoe is again the provider, this time slipping a clever ball through to Johnson. The winger is run a little wide, but gets to the ball ahead of Howard and pulls the ball back. The goal is gaping, but his pass finds an Everton player, and the home side clear.\n47 min: The current scoreline notwithstanding (as it should be when a team is beating Sunderland), I’m finding it very difficult to ascertain the managerial quality of David Moyes and Roberto Martinez,” emails Stephen Mitchell. “Look at Martinez’s tenure at Wigan and Everton. Now look at Moyes’ tenure at Everton, Man Utd, and now relegation-threatened Real Sociedad. Also consider the fact that Wigan are now down in League 1, while Man Utd are now clinging on to fourth despite having spent loads of money after Moyes’ departure. Are these results largely a case of a certain style of manager being right for a certain kind of club? If that is indeed the case, one might argue that Moyes was a perfect fit for Everton, while Martinez would be a good fit for Moyes’ position at Real Sociedad.”\nEverton don’t even have time to take kick-off again. They’ve had 75% possession this half, but the score is probably a fair reflection of who did what. Sunderland were the better side in the first 15 mins, hitting the post twice, but were woeful as soon as they went behind. They don’t seem to have got to grips with the 3-5-2. Expect changes. Big Sam, you’re back in it!\n"
}
