{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/11/02/world/europe/russia-plane-crash-sinai-peninsula-egypt.html?hp&_r=0",
    "language": "english",
    "text": "ST. PETERSBURG, Russia — Russia held a day of mourning on Sunday for the 224 people, mostly young families on vacation, who died in a passenger jet crash in Egypt on Saturday that was said to be Russia’s worst single air disaster.\nFlight recorders from the Airbus A321-200 airplane that had been recovered a day earlier were in good enough condition to decipher, Maksim Sokolov, Russia’s minister of transportation, said Sunday.\nBut no new details of the possible cause of the crash came to light. Government officials and airline executives were considering both mechanical failure and terrorism as possible causes.\nMr. Sokolov had issued a statement on Saturday rejecting reports that the plane had been the target of a terrorist attack as “fabrications.”\nStill, Emirates airline on Sunday joined Air France and Lufthansa in announcing that flights would be rerouted around the Sinai Peninsula as a precaution until the risk of a surface-to-air missile attack could be ruled out. Lufthansa said this would involve rerouting flights to six destinations.\nPresident Vladimir V. Putin of Russia established a state commission to investigate the crash. The Russian government also sent planes from its emergency services to take to the scene a team of investigators, who arrived on Sunday.\nBy midmorning, search crews had transferred 163 bodies from the site to Egyptian hospitals and morgues.\nThe crash threw a spotlight on the extraordinary popularity among Russians of wintertime vacations to Egypt, which is widely considered here the cheapest destination with reliable winter sun.\nThe sharp drop in the value of the ruble and tensions with the West over the past year have sharply diminished the number of Russians traveling. But despite the downturn, Russian tourism to Egypt has declined only 13 percent this year, compared with a 25-percent drop in travel to Turkey and a 43-percent decline in travel to Spain.\nA basic package tour, including a flight, hotel and meals, can be had for as little as $500 or $600 a week — but often comes with a trade-off: transportation on aging airplanes operated by little-known charter airlines.\nThe wife of the co-pilot of the Airbus that crashed told Russia’s NTV channel that her husband had complained about the mechanical condition of the plane, operated by Kogalymavia, a private company flying planes under the name Metrojet. The woman, Natalya Trukhacheva, told the station that her husband had said “before the flight that the technical condition of the airplane left much to be desired.”\nOn Sunday, the newspaper Izvestia reported that the airline had fallen into financial difficulties recently and owed money to a pension fund. A spokeswoman for the airline said on Saturday that its planes had undergone regular maintenance and were flown by experienced pilots.\nRussia’s transportation regulator, Rostransnadzor, said Sunday that it had ordered Metrojet to inspect its Airbus A321 airplanes; the airline said this could be done by rotating planes out of service, without grounding its whole fleet.\nA reporter for Russian state television, Rossiya 24, reported on Sunday from the crash site that the debris lay scattered over a wide area. The tail section lay about 5 kilometers, or 3 miles, from the nose.\nViktor Sorochenko, director of a crash investigation agency for former Soviet countries, the Interstate Aviation Committee, told journalists after inspecting the crash site on Sunday that the wide distribution of debris indicated the plane had broken up in the air. The debris covered a field of 20 square kilometers, or about 8 square miles. He declined to speculate on the cause.\nRBK, a Russian newspaper, noted that the passenger manifest included many people with the same last names, indicating that the plane was packed with families on vacation.\nTwo of the passengers were Yuri and Olga Sheina, a husband and wife from St. Petersburg who had meticulously documented their holiday on VKontakte, a Russian version of Facebook.\nThe trip was intended to celebrate a special day, Oct. 27, the fourth anniversary of their wedding and also the tenth anniversary of the day they first met, according to their posts.\n“Egypt, sun, sea,” Mrs. Sheina wrote before leaving St. Petersburg, a city that grows increasingly dark and gloomy at this time of year. “We are flying on vacation!”\nOn the anniversary date, celebrating by the sea, she wrote, “this is the day we met and fell in love with each other forever,” and posted coquettish snapshots of herself posing before a spray of bougainvillea flowers, smoking a water pipe and sunning by a pool.\nThe last post showed her husband carrying onto the Metrojet Airbus their 3-year-old daughter, who wore a pink T-shirt that said “Sweetie” on it. “Hello Peter, Goodbye Egypt” the girl’s mother wrote.\nBut the plane never made it out of Egypt, crashing about 25 minutes after takeoff in the Sinai Desert. The first remains were expected to arrive later Sunday in St. Petersburg, where the authorities had collected DNA samples from 140 relatives by Sunday morning to aid in identifying the victims.\nOn Sunday, St. Petersburg mourned. Through the day, flowers and stuffed animals piled up at a makeshift memorial at Pulkovo airport, forming a somber scene as Russians commemorated their dead, lowered their heads, and cried.\n“This is a personal tragedy of St. Petersburg,” said Dmitry Komarov, who came to the shrine with his wife, Anastasia Komarova. She was weeping.\nWhile travelers passing the airport memorial said they now feared to fly on charter airlines, others saw terrorism as the likely culprit.\nSergei Kubar, who traveled to the Sharm el-Sheikh resort just a month ago with a different airline, blamed terrorists. “When Putin started to bomb Syria, I said we could expect something like this.”\nOne man, who offered only his first name, Ivan, came to commemorate a friend, a man he had met years earlier in a cafe and had stayed in touch with.\n“He was just a good person, a friend,” Ivan said, as he blinked his eyes filling with tears.\nThe stack of flowers, in bouquets of even numbers, the tradition for honoring the dead here, grew on a bench along with multiple rows of soccer balls, teddy bears and other toys laid out on the ground in a farewell to the children who died.\n"
}
