{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/11/6/9679740/motorola-droid-turbo-2-review-specs",
    "language": "english",
    "text": "I'm biking through Brooklyn when the Droid Turbo 2 slips from my hand and smacks the pavement. For any other phone, this would be a disaster — a spiderweb of cracks across the screen, if not a totally smashed pane of glass sending tiny shards everywhere. But this is the Droid Turbo 2, so things are different. When I pick up the phone, there isn't a single new scratch on it's screen. It's just ready to go.\nThe Droid Turbo 2 is the latest flagship in Motorola's Droid line for Verizon. It's an iteration on Motorola’s well-received Moto X Pure Edition and Moto X Play, with a few key changes inside and out. The most notable, of course, is that screen: Motorola says that it's created the first ever \"shatterproof\" smartphone display, and it's debuting on the Turbo 2. Motorola's promise is that no matter how many times you drop this phone — so long as you aren't actively trying to torture it — the Turbo 2's screen won't crack or shatter.\nIt's an appealing promise, especially since broken smartphone screens are among the biggest scourges of modern technology. I see people reading and playing games on cracked smartphone screens every single day on the subway. And while there are no perfect numbers on how widespread this is, the figures out there suggest broken screens are a huge problem. The research firm IBISWorld found that a quarter of all US smartphone repairs are to service broken screens; similarly, in a study on iPhones, warranty company SquareTrade found that a quarter of all people had broken their screen at some point. So surely, there ought to be interest in an unbreakable smartphone screen.\nIf you've seen a Motorola phone in the last two years, then you'll recognize the Turbo 2. Gone is (most of) the embarrassing robo-grunge Droid aesthetic that's plagued earlier models in the line, and in is Motorola's standard design language. Motorola basically put no extra effort into styling this thing — and that was an absolutely wonderful decision. The Turbo 2 looks and feels good. There's a plastic front rim, a thick piece of metal running around all four sides, and then a back plate that can be customized by buyers. The unit Motorola lent me has a fairly tame, textured, white back, which is nice, but not what I would have picked out. The colorful backs are much more interesting, and the white front just has too many sensors sticking out.\nIn the center of that is the Turbo 2's 5.4-inch display, which is really the entire story of this phone. It's a perfectly fine size, slightly smaller than the Moto X Play and slightly bigger than last year's Turbo; bezels are narrow, so it's easy enough to use (mostly) one-handed even for a person like myself with smaller hands.\n  This screen really doesn't crack  \nMotorola isn't lying when it says this screen can't be shattered. In my week with the phone, I've dropped it down flights of stairs, let it fall out of my pocket and onto the sidewalk time and again, and knocked it off of tables, chairs, and desks, all without sending a crack rippling across it. By all means, my Turbo 2 should be a mess — I've put it through more knocks and spills in a week than most phones will receive over two years — but its screen remains in impressive shape. (I tried to put the Turbo 2 through the type of falls a phone might reasonably encounter; CNN managed to put a huge dent in one by having a horse step on it.)\nBut note that Motorola doesn't say the Turbo 2's screen is unbreakable. It is, simply, \"shatterproof,\" and there's a big difference between the two. While the screen has yet to shatter on the Turbo 2 I've been using, it has picked up a few small dings along the way, which hover over the display like little smudges that you can't wipe away. The screen is also extremely sensitive to scratches, picking up several after just a few minutes sharing a pocket with my keys.\n  The Turbo 2 won't take much damage in normal use  \nMotorola makes no promises about the Turbo 2's body holding up either, although it's done well over the course of the many drops I've put it through. The metal band around its side has scratched and chipped, and some plastic on the corners has crumpled up. It doesn't weather beautifully, but I'm impressed that it isn't in much worse shape. I suspect many other phones would be.\nSo yes, the Turbo 2's screen can be damaged if you keep on dropping it. But the takeaway isn’t that Motorola did an imperfect job — it’s that the Turbo 2 can take a beating and only show small signs of wear. My use of the Turbo 2 isn't going to be typical, either. Optimally, no one will ever drop this (or any other) phone. But if you do drop the Turbo 2 every once in a while, it'll more than likely come out unscathed or close to it. And though the screen can still pick up a ding or two, that's far less of an issue than a series of cracks. (Motorola will even replace the display if it does shatter or crack within four years of purchase.)\nTo make a screen that won't break, Motorola did two main things. First, it put a back-up touch layer above the display, since touch-sensitivity often breaks even when the screen does not. And second, it essentially built a screen protector into the phone. Rather than having a smooth layer of glass over top the display like other high-end smartphones, the Turbo 2 has two plastic layers, the topmost of which is said to be coated to protect against dents and scratches.\nThe use of plastic — and multiple layers of it — may be a necessity when it comes to achieving Motorola's \"shatterproof\" goal, but it leads to several downsides. Most notably, the Turbo 2's display isn’t as nice as those on comparable smartphones. Text appears slightly soft, and colors are somewhat dull. It really stands out when you put the Turbo 2 side by side with the Moto X Pure Edition. While the Pure Edition has a lower pixel density (both have a Quad HD resolution), it looks sharper and more vibrant. Part of that is certainly the Pure Edition’s glass cover, but you have to wonder how the Turbo 2's AMOLED display comes off duller than the Pure Edition's LCD.\n  The other highlight feature is battery  \nWhile the Turbo 2 may have a worse display than the top-of-the-line Moto X, it matches it or comes out on top in other areas. The phone has a Snapdragon 810 processor, 3GB of RAM, and 32GB of base storage. It runs fast and smooth, and since it uses a mostly uncustomized version of Android Lollipop, there isn't much to complain about (once you remove Verizon's tacky wallpaper and widget, that is.).\nThis being a Verizon-exclusive phone, there are other unwanted additions to both software and hardware. There's a Verizon logo on the front and a Droid logo on the back; both are ugly, but I promptly forgot that both existed. There are also nearly two dozen pre-installed apps, almost half of which are from Verizon. Some of the apps you may legitimately want — like the Kindle app or, let's be real, the two Candy Crush clones — but most of it is junk that you'll want to get rid of. And, unfortunately, you'll have to if you buy this phone in the US, since it’s only sold on Verizon. People living elsewhere can avoid the nuisance and pick up a Moto X Force.\nThe Turbo 2 has one other standout feature: its battery. Like past Droid phones, the Turbo 2 is supposed to last for 48 hours on a single charge, and — like past Droid phones — it doesn't quite make it to that estimate. In my time with the Turbo 2, it's regularly lasted through two \"days\": from the morning of one day to the evening of the following day, but not quite a full 48 hours. I'd put it closer to 36-40 hours, depending on your usage. On one exceptionally heavy day of use — including at least a couple hours playing Hearthstone — I brought the battery down to 10 percent in around 14 hours.\n  The Turbo 2 easily makes it through a day of heavy use  \nThat's an impressive battery life for any phone, but let it be known that \"two days\" is, for the most part, a useless milestone. Are you really not going to plug your phone in every other night? All that matters is that the Turbo 2 makes it through a full day of heavy use, and that's a milestone most phones don't actually meet. Motorola may overshoot a bit on battery capacity here, but I can trust that the Turbo 2 won't die when I need it most.\nThe last key piece of the Turbo 2 worth touching on is its camera, especially since high-end Android phones have gotten so much better this year. The Turbo 2, likewise, can take some great shots in bright daylight, and its HDR photos come out particularly detailed without looking too unnatural. But even at its best, there's often a lingering digitalness to these photos that doesn't come through on better cameras.\nThe bigger issue is that the Turbo 2's camera is inconsistent in lower light. Most of the time I tried to photograph someone indoors, they turned into a blurry mess. Other shots came out with muted colors or missed focus. The camera app isn't easy to control, either, and it can often be slow to snap a shot. For all that frustration, I did end up with some nice photos, but the inconsistency always left me wondering what I was going to get.\nMotorola cares about what's practical, and in many ways, the Droid Turbo 2 is the most practical smartphone out there. It doesn't have flashy features like a second screen, or a 3D camera, or a bendable body. But it does continue Motorola's pursuit of creating features that you'll actually use: like automatically silencing your phone when you're in meetings, or switching into a hands-free mode when you're driving, or letting you view notifications without turning on your screen. A battery that won't die all day is practical. And a screen that trades quality for durability is perhaps its most practical choice yet.\n  A lot of people should consider a shatterproof screen, but not at this price  \nAnd that's what makes the Turbo 2 so hard to settle on. This is a $624 phone — up there in price with the best of the best. Picking the Turbo 2 means picking a display that is good, but not great, simply because you're worried you'll break it. And given that the Moto X Pure Edition sells for $399.99, you could possibly even buy that, break it, and repair it a couple of times before you'd have spent more than the Turbo 2 costs. Motorola also could have done more to address the second most common destroyer of phones: water. The Turbo 2 is supposed to be splash proof, but a spill into the sink might take it out.\nA year or two ago, when all of our phones cost $200 (and two years of our lives), it would have made a lot of sense to give up the best display and pick the practical choice. But once you're paying $624 for a smartphone, you've already given up on what's practical.\nMotorola has hinted that this shatterproof display will eventually make its way to other phones, and that's good news. For a whole lot of people, I think it makes sense to trade tip-top screen quality to make sure that your display won't break — this would be a particularly great addition to something like the $179 Moto G. But for those of us looking for the best phone out there, buying the Turbo 2 means buying something that's less than the best. If you're that worried about cracking a flagship phone's screen, just put a case on it.\n"
}
