{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/11/03/science/nasa-adds-to-evidence-of-mysterious-ancient-earthworks.html?mabReward=A1&_r=0",
    "language": "english",
    "text": "High in the skies over Kazakhstan, space-age technology has revealed an ancient mystery on the ground.\nSatellite pictures of a remote and treeless northern steppe reveal colossal earthworks — geometric figures of squares, crosses, lines and rings the size of several football fields, recognizable only from the air and the oldest estimated at 8,000 years old.\nThe largest, near a Neolithic settlement, is a giant square of 101 raised mounds, its opposite corners connected by a diagonal cross, covering more terrain than the Great Pyramid of Cheops. Another is a kind of three-limbed swastika, its arms ending in zigzags bent counterclockwise.\nDescribed last year at an archaeology conference in Istanbul as unique and previously unstudied, the earthworks, in the Turgai region of northern Kazakhstan, number at least 260 — mounds, trenches and ramparts — arrayed in five basic shapes.\nSpotted on Google Earth in 2007 by a Kazakh economist and archaeology enthusiast, Dmitriy Dey, the so-called Steppe Geoglyphs remain deeply puzzling and largely unknown to the outside world.\nTwo weeks ago, in the biggest sign so far of official interest in investigating the sites, NASA released clear satellite photographs of some of the figures from about 430 miles up.\n“I’ve never seen anything like this; I found it remarkable,” said Compton J. Tucker, a senior biospheric scientist for NASA in Washington who provided the archived images, taken by the satellite contractor DigitalGlobe, to Mr. Dey and The New York Times.\nRonald E. LaPorte, a University of Pittsburgh scientist who helped publicize the finds, called NASA’s involvement “hugely important” in mobilizing support for further research.\nThis week, NASA put space photography of the region on a task list for astronauts in the International Space Station. “It may take some time for the crew to take imagery of your site since we are under the mercy of sun elevation angles, weather constraints and crew schedule,” Melissa Higgins of Mission Operations emailed Dr. LaPorte.\nThe archived images from NASA add to the extensive research that Mr. Dey compiled this year in a PowerPoint lecture translated from Russian to English.\n“I don’t think they were meant to be seen from the air,” Mr. Dey, 44, said in an interview from his hometown, Kostanay, dismissing outlandish speculations involving aliens and Nazis. (Long before Hitler, the swastika was an ancient and near-universal design element.) He theorizes that the figures built along straight lines on elevations were “horizontal observatories to track the movements of the rising sun.”\nKazakhstan, a vast, oil-rich former Soviet republic that shares a border with China, has moved slowly to investigate and protect the finds, scientists say, generating few news reports.\n“I was worried this was a hoax,” said Dr. LaPorte, an emeritus professor of epidemiology at Pittsburgh who noticed a report on the finds last year while researching diseases in Kazakhstan.\nWith the help of James Jubilee, a former American arms control officer and now a senior science and technology coordinator for health issues in Kazakhstan, Dr. LaPorte tracked down Mr. Dey through the State Department, and his images and documentation quickly convinced them of the earthworks’ authenticity and importance. They sought photos from KazCosmos, the country’s space agency, and pressed local authorities to seek urgent Unesco protection for the sites — so far without luck.\nIn the Cretaceous Period 100 million years ago, Turgai was bisected by a strait from what is now the Mediterranean to the Arctic Ocean. The rich lands of the steppe were a destination for Stone Age tribes seeking hunting grounds, and Mr. Dey’s research suggests that the Mahandzhar culture, which flourished there from 7,000 B.C. to 5,000 B.C., could be linked to the older figures. But scientists marvel that a nomadic population would have stayed in place for the time required to fell and lay timber for ramparts, and to dig out lake bed sediments to construct the huge mounds, originally 6 to 10 feet high and now 3 feet high and nearly 40 feet across.\nPersis B. Clarkson, an archaeologist at the University of Winnipeg who viewed some of Mr. Dey’s images, said these figures and similar ones in Peru and Chile were changing views about early nomads.\n“The idea that foragers could amass the numbers of people necessary to undertake large-scale projects — like creating the Kazakhstan geoglyphs — has caused archaeologists to deeply rethink the nature and timing of sophisticated large-scale human organization as one that predates settled and civilized societies,” Dr. Clarkson wrote in an email.\n“Enormous efforts” went into the structures, agreed Giedre Motuzaite Matuzeviciute, an archaeologist from Cambridge University and a lecturer at Vilnius University in Lithuania, who visited two of the sites last year. She said by email that she was dubious about calling the structures geoglyphs — a term applied to the enigmatic Nazca Lines in Peru that depict animals and plants — because geoglyphs “define art rather than objects with function.”\nDr. Matuzeviciute and two archaeologists from Kostanay University, Andrey Logvin and Irina Shevnina, discussed the figures at a meeting of European archaeologists in Istanbul last year.\nWith no genetic material to analyze — neither of the two mounds that have been dug into is a burial site — Dr. Matuzeviciute said she used optically stimulated luminescence, a method of measuring doses from ionizing radiation, to analyze the construction material, and came up with a date from one of the mounds of around 800 B.C. Other preliminary studies push the earliest date back more than 8,000 years, which could make them the oldest such creations ever found. Other materials yield dates in the Middle Ages.\nMr. Dey said some of the figures might have been solar observatories akin, according to some theories, to Stonehenge in England and the Chankillo towers in Peru.\n“Everything is linked through the cult of the sun,” said Mr. Dey, who spoke in Russian via Skype through an interpreter, Shalkar Adambekov, a doctoral student at the University of Pittsburgh.\nThe discovery was happenstance.\nIn March 2007, Mr. Dey was at home watching a program, “Pyramids, Mummies and Tombs,” on the Discovery Channel. “There are pyramids all over the earth,” he recalled thinking. “In Kazakhstan, there should be pyramids, too.”\nSoon, he was searching Google Earth images of Kostanay and environs.\nThere were no pyramids. But, he said, about 200 miles to the south he saw something as intriguing — a giant square, more than 900 feet on each side, made up of dots, crisscrossed by a dotted X.\nAt first Mr. Dey thought it might be a leftover Soviet installation, perhaps one of Nikita S. Khrushchev’s experiments to cultivate virgin land for bread production. But the next day, Mr. Dey saw a second gigantic figure, the three-legged, swastikalike form with curlicue tips, about 300 feet in diameter.\nBefore the year was out, Mr. Dey had found eight more squares, circles and crosses. By 2012, there were 19. Now his log lists 260, including some odd mounds with two drooping lines called “whiskers” or “mustaches.”\nBefore setting out to look for the figures on the ground, Mr. Dey asked Kazakh archaeologists whether they knew of such things. The answer was no. In August 2007, he led Dr. Logvin and others to the largest figure, now called the Ushtogaysky Square, named after the nearest village.\n“It was very, very hard to understand from the ground,” he recalled. “The lines are going to the horizon. You can’t figure out what the figure is.”\nWhen they dug into one of the mounds, they found nothing. “It was not a cenotaph, where there are belongings,” he said. But nearby they found artifacts of a Neolithic settlement 6,000 to 10,000 years old, including spear points.\nNow, Mr. Dey said, “the plan is to construct a base for operations.”\n“We cannot dig up all the mounds. That would be counterproductive,” he said. “We need modern technologies, like they have in the West.”\nDr. LaPorte said he, Mr. Dey and their colleagues were also looking into using drones, as the Culture Ministry in Peru has been doing to map and protect ancient sites.\nBut time is an enemy, Mr. Dey said. One figure, called the Koga Cross, was substantially destroyed by road builders this year. And that, he said, “was after we notified officials.”\n"
}
