{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/11/01/technology/mike-and-jims-week-in-tech-googles-new-version-of-android.html?ribbon-ad-idx=5&_r=0",
    "language": "english",
    "text": "Each Saturday, Farhad Manjoo and Mike Isaac, technology reporters at The New York Times, review the week’s news, offering analysis and maybe a joke or two about the most important developments in the tech industry. Mr. Manjoo is off this week, so Mr. Isaac is conversing with Jim Kerstetter, deputy tech editor.\nMike: Another week, another newsletter without Farhad Manjoo. Also known as “vacation Manjoo.”\nBut look! It’s trusty deputy tech editor and guy-who-could-probably-fire-me Jim Kerstetter! Did I mention you’re looking particularly svelte today, Jim?\nJim: Why thank you, Mike. Might I say your beard looks particularly lush? Are you using conditioner?\nMike: You noticed! Beard oil, actually. I’m not kidding.\nSo it has been quite a week in our industry. Apple released another record quarter of sales, and analysts all shrugged and predicted the eventual end of the iPhone boom, as they tend to do. Nintendo released its first smartphone game, which for some reason did not involve Mario or anyone wearing overalls and a mustache. I predict catastrophe.\nJim: First of all, it’s pretty astonishing that Nintendo just released its first smartphone game. Did they think these smartphone things were a fad? My daughter’s little Nintendo DS is sitting on a bookshelf in our living room. It has been sitting on that shelf for two years. As for Apple, what can you say? At some point when you’ve saturated the United States, Europe and China, sales are going to slow down. I’m not saying they’re at that point. But what goes up…\nI’d like to talk a little about Twitter. Mike, you’ve covered them since the early days. Is Jack Dorsey intentionally trying to scare the daylights out of his investors? He has excelled at talking down expectations. \nMike: It’s interesting. On the one hand, you could see Dorsey’s response as pragmatism: He came into a situation where the product is difficult to understand, people aren’t coming to Twitter in droves, and it’s not an overnight fix. He’s trying to tell people that he’s in it for the long haul, and things may sting for a while.\nBut I think you’re right, it has been a bit much with the doom and gloom of the last two earnings calls. Maybe next time he goes for something less David Lynch and more, uh, Steven Spielberg?\nAnother thing I want to mention is this news about Google’s Chrome operating system eventually becoming the same thing as its Android system. Or something like that. It’s not clear, really, except to say that something is happening. Eventually.\nLet’s step back a bit into super wonky nerd history. Once upon a time, Google had two nascent software projects: Chrome, a web browser, and Android, a mobile operating system. As with all successful things, they started small and grew into powerhouses in their own respective industries. Google’s Chrome browser has eaten up tons of browser market share. And Android, as we all know, is the most widely used mobile operating system in the world. Google did well for itself.\nSo what? Well, The Wall Street Journal published an article on Thursday saying the two systems — which have long been speculated to be on a collision course — will eventually be folded together under the Android brand and operating system.\nI have my thoughts here. But since I talk a lot and we have this opportunity to hear from a wise and benevolent editor, you tell me if we should all freak out and start looting stores for the last remaining Chromebooks.\nJim: Who said I’m benevolent? No need to freak out. Let’s not confuse Chrome, the web browser I am now using, with Chrome OS, the other operating system at Google. Chrome OS was built on top of Chrome, the browser, but it is not the same as the browser. The browser known as Chrome is not going anywhere, and the operating system known as Chrome OS is also not going anywhere, according to people who are aware of these things but won’t say it on the record. They’re not killing it. At least not yet.\nWhat Google does plan to do is make sure Chromebooks can work on Android. Makes sense. Chrome OS was always a head-scratcher. It came out after Android and seemed to be competing with Android for oxygen at the Googleplex — but Chrome OS lost. Google can’t say, “Hey, we’re dumping Chrome OS” because they’ve sold millions of Chromebooks into academia and people there would reasonably freak out if they did. What they can do, however, is create some sort of transition period between the two.\nA little side note: Sundar Pichai, who now manages the part of Alphabet (it’s going to take a few years to get used to saying that) that is still called Google, ran development of Chrome OS in its early days. The man is clearly not a sentimentalist.\nDo you know anyone who owns a Chromebook?\nMike: My mom loves Chromebooks! The last time I met Pichai I showed him a text from my mom who was going nuts over her Chromebook. He was psyched. It’s basically an email and Internet machine, which is good for people who aren’t editing video or killing zombies on a powerful PC.\nShe has bought four of them in the past four years. My mom breaks things.\nJim: Now let’s talk about two things happening next week: Hewlett-Packard finally splits in two and San Francisco votes on wicked strict laws on Airbnb rentals.\nThis election in San Francisco on Tuesday is going to be fascinating: It’s like the whole city decided to vote on what it thinks of the tech industry in a bunch of propositions, not just the Airbnb regulations. My neighborhood does not have a big tech population, but where I used to live, in Noe Valley, has completely changed since I moved there in 2000. It’s the new Pacific Heights. And for those of you who don’t live in San Francisco (And why wouldn’t you? It’s really nice.), that means it has gotten insanely expensive. Is there still room in the city for people who don’t expect to have an equity event?\nHP reminds me of the old Yankee Stadium. Sure, it was iconic and historic and all that, but chunks of cement were falling off the darn thing. HP is, as they say, the foundational Silicon Valley company. But it has been going through this “who are we?” corporate soul searching since the ’90s. It has had a succession of C.E.O.s flame out spectacularly, and the amazing thing is it still employs 300,000 people. Will you be taking off your hat for a moment of silence Sunday when the old HP officially fades away?\nMike: It’s funny. I grew up with a Gateway, then a Compaq, then a Dell, and I think an HP before switching to Macbooks. So I have a bit of sentimentality around the decline and fall of a storied institution in need of a serious reset.\nThat said, my HP printer in college was total garbage and the ink was a rip-off. So I’m not super broken up about it.\nO.K., thanks for stopping by, Jim! Let me know if you ever want to take over for Farhad again. Permanently.\nJim: Thanks, Mike. This was fun. I hope our readers in San Francisco remember to vote Tuesday. By the way, beard oil?\n"
}
