{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://bits.blogs.nytimes.com/2015/10/30/amazon-shutting-down-its-register-credit-card-processor/?ribbon-ad-idx=5&_r=0",
    "language": "english",
    "text": "There is one fewer player in the payments processing game.\nAmazon, the online retailing giant, quietly killed its credit card reader service for small and medium-size businesses, a move that seems to scale back the company’s ambitions of going after micromerchant processing services. The credit card reader, called Amazon Register, debuted to much fanfare little more than a year ago.\nAimed at mom-and-pop merchants, the $10 plastic device plugged into a smartphone or tablet and, with an app, processed credit card swipes from customers. Much like competing products from Square and PayPal, the idea was to bring payments processing to businesses that did not previously offer it.\nThat plan did not work out. Amazon stopped offering the device to new merchants as of Friday evening, and it will stop supporting Amazon Register by February.\nThe company did not offer an explanation on its product’s website. In a statement, the company said, “Effective February 1, 2016, we will discontinue Amazon Register. We are constantly testing and launching new services to innovate on behalf of our customers. At this time, we have decided to discontinue the Amazon Register service.”\nThe move looks to be a part of a wider shuttering of locally-based products and services. As Geekwire first reported, Amazon also plans to stop selling daily deals through its “Local” service by the end of the year.\nIt is an abrupt about-face for the online retailer, whose entrance into merchant processing services looked to be a new formidable opponent for other companies in the space. And at the time, Amazon’s reader came with an enticing offer: For a time, the company would charge a full percentage point less than competitors like Square, which is on the precipice of an initial public offering, on each credit card swipe.\nBut small merchants may have been wary of using Amazon’s credit card reader. At the time, some retailers were concerned that using Amazon’s services could give the company even more insight into shoppers’ purchasing habits and, eventually, the giant company could use that data to its advantage against smaller, offline businesses.\n"
}
