{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.nytimes.com/2015/11/02/sports/running-while-juggling-is-barred-by-marathon-organizers.html?ref=sports&_r=0",
    "language": "english",
    "text": "As an elite joggler — that is, someone who runs while juggling — Michal Kapral of Canada is used to doing things the hard way. But at this year’s New York City Marathon, that will mean settling for an ordinary 26.2 miles, empty-handed. Marathon organizers have banned joggling from the course, ruling that beanbags filled with millet seed, liked Kapral’s, count as “Prohibited Items.”\nKapral, a 43-year-old editor at a health care group in Toronto, had hoped this year to improve on his world-record joggling time of 2 hours 50 minutes 12 seconds — an impressive feat even for a serious runner who does not bother juggling on the course. A serious athlete by most measures, Kapral’s best marathon time is 2:30:40, and he once won a marathon outright while joggling. On Sunday morning, he was still grappling with leaving his beanbags behind.\n“I understand there have to be security rules, but this seems like it’s crossed a line where it gets to be intrusive, and maybe less about real security than about rules that end up stopping us from having fun,” Kapral said. “But what I’m really disappointed about is the kids. They love to watch me joggle.”\nThe joggler’s beanbags join an esoteric list of other contraband nixed from the racecourse: no sleeping bags, no pets, no mace and no drones. Knitting needles are also forbidden, so David Babcock, who has the world record for the longest scarf knit during a marathon (12 feet), will be crocheting flowers out of yarn with his fingers. No one, it appears, has contested the ban on selfie sticks.\nKapral said he had counted on being a part of what he called a rich tradition of joggling at the New York City Marathon, dating from when the race founder Fred Lebow embraced the craft himself, saying, “I see joggling as only positive.”\nBut when Kapral contacted New York Road Runners to confirm his intent to joggle, supplementing his appeal with a lengthy footnoted anthology of his joggling accomplishments, he was surprised by the curt response.\n“I figured they would say, ‘That’s cool, keep your tennis rackets and swords at home, but we have a long history of joggling so don’t worry about it,’ ” he said. “When I got an email saying joggling is not allowed, my heart sank. I kind of wanted to cry because even though it’s just joggling, I really do love it.”\nOther jogglers, like Jack Hirschowitz, a New Yorker known as the Intellectual Joggler, were also asked to cease joggling at Road Runner races.\nChris Weiler, a spokesman for New York Road Runners, confirmed the new policy: “In consultation with N.Y.P.D., our guidelines changed following the Boston Marathon bombing and running with props was prohibited,” he wrote in an email.\nReactions from the tight-knit joggling community were swift and furious, with members expressing concern from as far as Afghanistan and the Central African Republic.\nIn an embittered blog post, the joggler Chris Pert called the announcement “arguably the biggest bummer in joggling history.” He continued: “Unfortunately, I suspect that there’s more to this than just security concerns. Some people just don’t take joggling seriously.”\nFrom the Central African Republic, where he has taught the craft to scores of refugee children, Richard Alec Ross wrote, “Once again, I am reminded what living in a free country really means … thank you Central African Republic for being Pro-Joggling.” And from Afghanistan, Kapral’s American joggling rival Zach Warren weighed in. “I’ve joggled six major marathons,” he wrote. “Zero people were injured and thousands smiled.”\n“When Zach and I joggled in Boston,” echoed Kapral, “Jack Fleming, the B.A.A. marketing director, sent me a welcome email.”\nAfter the verdict, Kapral halfheartedly entertained some stopgap solutions. Perhaps he could joggle packets of energy gels, which are certainly allowed on the course. Or the little water bottles people stick in their waistbands? But nothing felt the same.\nTo cope, Kapral is drawing on resilience honed from a joggling career built on surmounting challenges.\nHe initially learned of joggling at age 11, when he saw the world record in a Guinness book. As an adult, Kapral began racing to raise charity money for sick children, first breaking the world record for running a marathon while pushing a stroller (carrying his daughter). He recalled the record and told some of the sick children’s parents that in his next fund-raising race for them, he would joggle.\n“Then I remembered: I don’t know how to do that,” he said.\nHe ordered some juggling balls, using the same model as the record-holder, and taught himself in a park every morning before dawn to escape observation by his neighbors.\n“I’d drop balls everywhere, into puddles of mud, and I wondered what I was doing,” he said. “But eventually I got better at it, and then I got addicted to it.”\nHe learned to avoid the sport’s pitfalls, like sore biceps and poor cadence, and upgraded from unwieldy balls to nimble beanbags (these days he trains with heavier balls than his lighter racing bags.) At his first charity joggling marathon, in 2005, he dropped the ball 25 times, adding precious minutes as he chased down the record. He still managed to shatter it, logging a 3:07:41.\n“I didn’t really know how to joggle, but I always knew how to suffer,” he recalled. “I think I’m really good at suffering, and joggling adds an extra element of that.”\nThen two months later he got a call from a student reporter at Harvard, asking how he felt about a divinity school student there breaking his record.\n“It turned out that Zach Warren, who I’ve come to accept as my American nemesis — and friend — broke my record by 40 seconds,” he said. “I replied: ‘I can’t have that. I challenge him to a marathon joggling duel.’ ”\nTen minutes later, Warren called Kapral to say, “I accept.”\nThey faced off at the 2006 Boston Marathon, joggling side by side at under a three-hour-pace for 17 miles, until Kapral dropped a ball on Heartbreak Hill and had to pause to collect himself. Then he spilled Gatorade on another ball and it got sticky. (The rules are, you have to stop and hold all three balls in one hand to drink.) Warren prevailed handily.\n“I didn’t want to stop there,” Kapral said. “I didn’t want to be the second-best joggler in the world.”\nHe trained harder than ever, joggling constantly, through long runs and speed work. “I really worked on my technique,” he said. “I spent a lot of time in the house juggling. I learned how to do five balls. From behind, you couldn’t even tell that I was joggling. It became seamless, free flowing. I had perfectly integrated the juggling into my running.”\nBut as his times dropped, so did Warren’s.\nAnother failed record attempt in 2007 was almost his final straw. “Tragically, I was on pace to break the record when I got a little tired at 25 miles,” he said. “I came to a complete stop, and ended up finishing a minute slower than the record. That was heartbreaking, and I announced my retirement from joggling. But then my wife, Dianne, convinced me to go back for the record one more time.”\nHe finally achieved his 2:50:12 later that year in Toronto, chewing gum at the same time for good measure. The record has stood for eight years.\nWith about 150 races under his belt, Kapral now owns the joggling half-marathon and 10-kilometer records, in addition to the marathon’s.\nHe has also collected a sizable fan base from his marathon joggling stints before thousands of people — even starring in a commercial for Fairfield Inn & Suites. His performances have garnering a range of reactions.\n“I’ve had women ask me to marry them, while children tend to cheer and clap,” he said. “A lot of teenagers just watch and say, “That is sick man.’ ”\nRunners can be less excited to see him, at least from behind.\n“Some people hate being beaten by some guy who’s joggling,” he said. “But maybe I help those ones go faster, so they can get in front of me.”\nNow that he will not be hindering them, he has thought about striking out on his own.\n“There are no road championships for joggling, so we try to sneak ourselves into the regular ones,” he said. “It would probably be a challenge to assemble enough runners for a joggling-only marathon, but maybe someday. Maybe it’s time.”\nHe now hopes to bring down his world record at the Los Angeles Marathon in February, mindful that at age 43, his days as an elite joggler may be numbered.\nMeanwhile, he proudly explains that his 10-year-old daughter has taken up the family craft of joggling herself, with an eye toward her father’s legacy. “She practices every day,” he said.\n"
}
