{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://bits.blogs.nytimes.com/2015/11/01/sap-chief-mcdermott-embarks-on-health-care-push-after-losing-his-eye/?ribbon-ad-idx=5&_r=0",
    "language": "english",
    "text": "On July 6, Bill McDermott, the chief executive of one of the world’s largest software companies, fell down the stairs at his brother’s house. He awoke in a pool of blood.\nMr. McDermott was holding a drinking glass when he fell, and it shattered and entered his face, leaving a vertical scar from above his left eye to below his ear. The glass also entered his left eye, causing him to lose the organ after unsuccessfully undergoing several surgeries and procedures to keep it.\nThe experience is spurring Mr. McDermott, 54, to move his company, SAP — a firm based in Germany that specializes in large-scale software for manufacturers, retailers and the like — deeper into health care. When Mr. McDermott returned to work in early October, his first public act was to talk about how SAP should be working to make health care better by focusing on more cross-disciplinary work, digitized information that can easily be shared and analyzed, and, yes, big data.\n“Doctors in my case were sending each other dictation to each other’s cell phones,” Mr. McDermott said in his first interview since the accident, the scars of his wound still visible under dark glasses. “There were digital files of M.R.I.s, data from my surgery in the trauma unit and scans from the emergency response team that never went into the case file.”\nWhether his eye could have been saved with a more networked cloud-computing system, where digital files could be easily stored and shared, Mr. McDermott didn’t know. But he said the process could be better. “The first responders, the doctors and the nurses were all wonderful, but they are too pressed,” he said. “The retina guy couldn’t talk with the cornea guy.”\nIt may be easy to pass off Mr. McDermott’s newfound enthusiasm for incorporating more SAP-type products into health care as opportunistic. But that misses an element of tech company leadership: When top tech executives and founders face personal health traumas, they often turn to their industry to fix things.\nThe examples are legion. Andy Grove, a legendary leader at Intel in the 1980s and 1990s, was diagnosed with Parkinson’s disease in 2000. Soon after, he began working with the Michael J. Fox Foundation, bringing together Intel and the Parkinson’s group for patient monitoring and analysis.\nPaul Allen, a co-founder of Microsoft who left the company in 1983 to successfully battle Hodgkin’s disease and who was later diagnosed with lymphoma, is spending billions on a better understanding of the human cell. Sergey Brin, Google’s co-founder who carries a gene that may cause Parkinson’s, has given millions of dollars for a better understanding of the disease and its treatment.\nEric Dishman, the head of Intel’s health and life sciences group, battled cancer in his kidneys for 23 years, experiencing 72 different and incorrect diagnoses. Five years ago, he was on his last business trip before needing daily dialysis, when a start-up offered to sequence his genome. It took three months using Intel’s high-performance machines, but doctors eventually deciphered unique aspects of his treatment.\n“I came back and said, ‘We have to give precision health to everyone,’” Mr. Dishman said. “There are too many health care executives who haven’t been through these things.”\nIntel now has a goal of getting genome-sequencing time down to one day by 2020, and wants research institutions to share more data.\n“You see this in the way people are passionate about the quantified self,” or better health through body sensors and computation, said Paul Saffo, a Silicon Valley historian at Stanford University. “The tech titans aren’t getting any younger, so they are thinking about mortality.”\nThey are also thinking about extending life. Google, now called Alphabet, has funded Calico, a life sciences company, which is charged with using advanced technology to control the human lifespan. And the X Prize Foundation — a Mountain View, Calif., nonprofit that is popular with techies — sponsors, through the semiconductor maker Qualcomm, a $10 million prize for whoever builds a body-analyzing machine like the tricorder from “Star Trek.” “Bring healthcare to the palm of your hand,” it says on the X Prize website.\n“On Wall Street, you throw money at a problem,” Mr. Saffo said. “Out here, the attitude of people is that problems can be fixed with tech. Right now, instead of research and development, there’s a sense of ‘search and redevelopment.’ There are answers out there in the data. Things just have to be done differently.”\nFew areas seem as ripe for tech-based reworking as the kind of siloed care Mr. McDermott experienced.\n“We imagine creating better oncology care using data from more diverse groups of patients,” said David Delaney, a doctor who works with SAP’s health care industries group. “Given Bill’s experience, we’re figuring out where to go in the better coordination of people and processes.”\nSAP currently sells a range of software to the health care industry, including patient billing and research tools. For the past several years, it has been moving from software that resides in on-site computers to cloud-based systems with more networking and big-data analysis that hospitals can access remotely.\nMr. McDermott, who hails from a working class family in Long Island, New York, says his weeks fighting to keep his eye have ultimately put him in a good place.\n“I’ve always felt like the luckiest guy in the world,” he said. “Now I feel like I’m on a mission. There are a lot of institutional problems in the system.”\n"
}
