{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.bbc.co.uk/sport/cricket/34691837",
    "language": "english",
    "text": "James Anderson and Stuart Broad gave England the better of the first day of the third and final Test against Pakistan in Sharjah.\nAnderson took 4-17 and Broad 2-13 as the hosts were bowled out for 234, Misbah-ul-Haq resisting with 71, before England closed on 4-0 from two overs.\nBut, on a pitch showing prodigious turn, England spinners Moeen Ali, Adil Rashid and Samit Patel disappointed.\nAnd England all-rounder Ben Stokes also left the field with a shoulder injury. \nStokes was hurt while attempting to catch Sarfraz Ahmed off the bowling of Patel and departed with his right arm in a sling. He will have a scan on Monday morning to discover the extent of the injury.\nWhile that provides a worry for an England team who must win to avoid a series defeat, so too will the threat of the Pakistan spin bowlers on a surface that turned throughout the first day.\nRelive day one of the third Test in Sharjah \nSeamers supreme...\nOn a pitch offering so much for the spinners, England were again dependent on the new-ball pair of Anderson and Broad for control and potency.\nBetween them, they returned figures of 28.1-15-29-6, including a spell after lunch when Broad's five consecutive maidens were followed by four Anderson overs for two runs.\nIn that time, Broad had Shoaib Malik caught by wicketkeeper Jonny Bairstow, handed the gloves following the decision to drop Jos Buttler, and Anderson pinned Younus Khan leg before to go with the edge behind he induced from Azhar Ali in the third over.\nAnd, when captain Misbah looked set to reverse the momentum late in the day by dismantling the spinners, Anderson and Broad returned with the second new ball to snuff out the resistance.\nBroad had Yasir Shah caught hooking, before Anderson had key man Misbah and number 11 Rahat Ali held in the slips. \n...and spinners struggle\nEngland's decision to field three front-line spinners was vindicated by the Sharjah surface, but not by the performance of the slow bowlers.\nMoeen, Rashid and Patel - playing his first Test since 2012 - returned combined figures of 4-175 from 46 overs. Whereas Broad and Anderson went for little more than a run an over, none of England's spinners managed an economy rate of 3.50.\nLeft-armer Patel was the pick. He produced two moments of quality to have Asad Shafiq caught behind and to bowl Wahab Riaz, while Moeen's two wickets fell to catches on the leg-side boundary.\nAll three were guilty of long-hops and full tosses, conceding a total of 18 fours and three sixes, compared to a combined five boundaries off pace bowlers Anderson, Broad and Stokes.\nMisbah defiant again\nJust as he did on the first day of the second Test, Misbah defied the England attack by negating the pace bowlers and targeting the spinners.\nAlmost shotless in defence against Broad and Anderson, the right-hander scored all but one of his nine boundaries against slow bowlers, heaving Rashid and Patel for a straight six each.\nIn all, Misbah scored just only runs from 68 balls against the pacemen, in contrast to 62 from 92 delivered by the spin trio.\nHe found a busy ally in Sarfraz for a sixth-wicket stand of 80, but when Sarfraz holed out off Moeen, it began a final slide of five wickets for 38 runs.\nMisbah was so bemused to win the toss for the third time in the series that he bent over with laughter and offered Alastair Cook a sympathetic pat on the back.\nCook was stony-faced, perhaps anticipating more toil for his bowling attack.\nAs it turned out, the coin toss has not necessarily given Pakistan the advantage of batting first, but rather of bowling last.\nWhat they said\nEngland pace bowler Stuart Broad told BBC Test Match Special: \"We're delighted, but I don't think anyone knows what a good score is. From the seamers' point of view it was quite easy to tie the batsmen down. If we have a good day with the bat tomorrow it makes today an excellent day.\"\nFormer England captain Michael Vaughan on TMS: \"Anderson and Broad have been outstanding. Apart from that, England have bowled poorly. The pitch has taken a huge amount of spin. You can understand Samit Patel because he hasn't played a lot of cricket, but Moeen Ali and Adil Rashid have bowled too many bad balls. Pakistan's 240 is probably worth 280. If Yasir Shah and Zulfiqar Babar get it right, there's a low score out there.\"\nFormer England opener Geoffrey Boycott on TMS: \"When Anderson and Broad were bowling there was nothing for Pakistan to hit, so there was always pressure on the batsmen. They were key. But we don't have quality spinners - they were expensive and let the pressure off.\"\nListen to Simon Mann and Geoffrey Boycott's review of each day's play via the TMS podcast \n"
}
