{
    "status": "OK",
    "warningMessage": "truncated-oversized-text-content",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/31/9647204/gm-phil-abram-infotainment-carplay-android-auto-interview",
    "language": "english",
    "text": "If you've bought a car in the last decade, you probably think of \"infotainment\" as a four-letter word.\nThe touchscreens in the centers of our dashboards have been, to put it bluntly, bad. In some ways, they're finally starting to catching up: the user interfaces are crawling, slowly, out of the stone age. They're getting bigger, which makes them easier to see and to use. Touch response times are getting better. And with the advent of CarPlay and Android Auto, there's a decent way to use our smartphones on the road without endangering the lives of everyone around us. Still, there's a lot of work to do.\nThat's where people like GM's Phil Abram come into play. Abram — who has stints at Sonos and Sony on his résumé — led the company's adoption of CarPlay and Android Auto, which will eventually reach just about every vehicle GM sells in the US. He's also coming off a connected car deployment in China after rolling out in Europe and North America, where LTE currently ships on 16 models.\nBut the challenges still loom large: as we discovered in our own reviews, neither CarPlay nor Android Auto are perfect, nor is the hardware that lies underneath. We sat down with Abram this week to find out where he stands on the connected car — and how it'll change in the age of smartphones, ubiquitous high-speed data, Tesla, and the upcoming Chevy Bolt.\nChris Ziegler: My understanding is that you led the integration efforts for Android Auto and CarPlay, is that right?\nPhil Abram: Yes. Our team did that, yeah.\nSo tell me a little bit about that process, because you have some that are hitting in March of next year, right? March or April?\nWell, we have vehicles today with both Android Auto and Apple CarPlay, and then we have one infotainment system that we’re putting in place that the specification for the Android Auto lagged a little bit, and so we delivered it to the marketplace with Apple CarPlay and we’ll have a software update available for those vehicles in the early part of the first quarter of next year.\nSo the majority of our vehicle fleet by that point in time will be enabled. New cars will be enabled with both.\nDo you have a date or a vision of a date for when you’ll be at 100 percent — if not Android Auto and CarPlay compatibility, at least having a touchscreen in the center stack?\nI don’t know if we’ll ever reach 100 percent, simply because — and I’m thinking on a global basis as well — we have radio delete in a lot of markets because they want as low a cost vehicle as they can get. An 8-inch color in a car costs money, and for some people they don’t want to make that investment. Right? For all the benefits that it has, it’s a personal choice, and so we try to accommodate and make sure our vehicles are accessible to people in a broad range of needs and income and what they can put into a vehicle.\nOver 70 percent of our global volume will probably be enabled within the next two years. Now, whether the markets they’re in support that is determinant on the rollout by Apple and Google of when they’re enabling different markets.\nDoes the specter of a Google car and an Apple car affect your strategy for supporting these systems? Do you think of it as a trojan horse of sorts?\nNot at all. Because the amount of code that’s actually in our vehicles — well, none of it comes from Apple or Google, first and foremost. They have a specification, and that code is what we implement to meet their specification.\nAnd all of the processing power is on the phone?\nCorrect, right. For those applications that they do. But they don’t do HVAC, they don’t do vehicle health, they don’t do many of the other things that are relevant and important to people in their vehicle. It’s a \"plus,\" it’s an \"and,\" it’s not an \"or\" situation for us.\nSmartphones are a part of people’s lives. If we claim to be a customer-centric organization, if we truly are, then we gotta to say, hey, that’s important in their lives. We have to make sure that it works, and we work with it as best we can. And today, as defined, that is the best integration, the best experience for people, because we worked with Apple and Google on making it that.\nBut that doesn’t mean we’re ceding our control of the in-vehicle experience to them. They’re not doing our infotainment systems. Much of the reporting on this is, I think, somewhat sensationalized because it’s a much better story to create this looming threat and this battle for the dashboard, or the in-car experience between these industry titans. That’s not the reality of it. We’re all saying, hey, how can we make the experience relevant, safe, and inviting for our collective customers? That’s really where we’re going with that.\nWe work with Apple and Google as closely as any of the other auto manufacturers. We’re a founding member of the OAA [Open Automotive Alliance]. We’re the first one to put Siri into a car. We’re going to have this on over 33 different models, and Tim Cook stood on stage and said there’d be 40 models with Apple CarPlay in them. So there are probably more than that, but we’re embracing this. We’re not saying we’re going to carve out something and try to protect by not doing. That’s a sure path to inevitable obsolescence. I’ve been at companies that did that. We’re embracing it. And what it says is, hey, we believe there are experiences in the car that can’t be delivered through phone integration, and we’re going to deliver those.\nCan you give me some examples?\nVehicle health management. The things we’re doing with proactive alerts, we’re going to be extending that more into the vehicle. So the vehicle is able to communicate to you more about its health and status than it does today, rather than with the orange \"check engine\" light, which is not particularly informative. You can’t do that with phone projection. So there are a number of things that we’re working on that really express what we call \"the ‘carness’ of the car.\"\nThe phone does four things really well inside the vehicle: phone, messaging, media, and navigation. That’s it. So everything else is really better served with taking the embedded systems and making sure that they’re capable of doing that. And, as we’re talking about connected car, the car itself needs to be on the grid and connected. And if you rely solely on the phone, the moment you leave the car with that, the car goes back to being a brick. That doesn’t make sense.\nThe car needs to be on the grid, it has to be part of the world around it, part of the ecosystem within it. And so to unlock a car, for example, remotely: if you’re relying on the phone and the car is the major way of doing it, and you’ve got the phone in your hand, you’re kind of screwed. So that’s why it’s more than just those four applications in the car.\nBut in iOS 9, CarPlay now supports vehicle apps that can appear as part of the phone projection, right? And Android Auto already had that capability.\nNeither of them have fully released the SDKs. And by the way, we’re the ones that drove them to do that. They weren’t planning on doing that until GM went to them and said, hey guys, for applications that make sense in that world, we want to be able to have an app that shows up as part of that experience.\nApple in particular, they don’t have a general SDK to allow developers in; it’s a little bit more narrow. Google is taking that approach more so than Apple. But I said, we want to have our application be presented through the phone integration like your phone or your navigation and the like. And so that’s why we worked with them to develop that.\nThere are capabilities that we want to leverage. We have our RemoteLink application on the phone, and it has a number of capabilities. We want some of that experience available when people are in the car, as well as today it’s on the outside of the car. Well, the best way to do that is to leverage phone integration, and so that’s why we worked with Apple and Google to do that. But you can’t do certain things, because the phone — regardless of what the people in Germany say — has a very, very limited set of vehicle data that’s available to it. There are six data elements that are available to it. So that inherently makes it not a good place to try to do deep vehicle integration.\n  \"The car needs to be on the grid, it has to be part of the world around it, part of the ecosystem within it.\"  \nAre you aware of any plans to expand the level of data that is available to the phone? Could we see a future system where that integration is tighter than it is today?\nNot at this time, no.\nI’ve only spent a very brief time with both of these systems, but I find that it’s a little distracting to have to switch between two worlds, right? You have the phone integration world, and then there are certain functions that may or may not be obvious that you need to exit from that system to get to. How do you solve that problem, or do you see it as a problem?\nI think it’s a transitional state, and we’re working with them to make that make more sense, more seamless in that regard. Not to hold up what we’re currently doing as the world’s best experience, but if you switch between navigation and audio in a car today, and even on a phone, if you move between these applications, you move between experiences. We’re working on making that a little more seamless, but I don’t find it jarring. But I think there’s room for us to improve on that for sure.\nI believe you have a low-end infotainment system that relies very heavily on the phone, is that right?\nThat one does rely more on phone integration. Like, there’s not a nav option for it, because we’re like, okay, for cost and for what people are using this device for, that doesn’t make sense for us to create another derivative with the nav option, particularly in the United States market. So we are leveraging the phone as the nav solution for those vehicles, if you will.\nOther vehicles where we can invest more and there’s more opportunity, we are offering embedded nav because it has closer integration with the rest of the vehicle operation. We sell cars that go from $13,000 up to $100,000. The range and needs and customers that are across that spectrum are pretty broad, and so we do a lot of things to meet those needs with those particular systems in those particular applications, and what the expectations of the customer are getting into each of those cars. And we want to exceed those expectations, and frankly, if it’s on a Cadillac, they’re going to expect an embedded navigation option.\n  \"...frankly, if it’s on a Cadillac, they’re going to expect an embedded navigation option.\"  \nI have a car with CarPlay on it and an embedded nav system. The embedded nav system is still just easier for me to use. It just is, because I just get in the car and go. Now, for other people that won’t be the experience that they want. This is about an \"and,\" not an \"or\" type of situation.\nThat being said, it’s interesting to me that a [Chevy] Spark customer is just as likely to have an iPhone as a [Corvette Stingray] Z06 customer, or a [Cadillac] CT6 customer. And that experience for them is the same. Obviously, the experience in the interior of a $30,000 vehicle is going to be different from a $100,000 vehicle, but does that same logic also necessarily apply to the center stack? You have a very different experience in [Cadillac] Cue than you do in, say, Chevy MyLink. But I’m wondering if maybe that’s a place where you need as much differentiation as you do in, say, the materials in the interior.\nIt has to be meaningful differentiation. And frankly, where we were as a company was gratuitous differentiation that didn’t actually add value to the customer or support the brand. And I like to say, there’s one good way to make a phone call. You don’t need to differentiate on how you make a phone call in a car with hands-free between a Sonic and a CT6. You don’t need to, so don’t apply effort and resources and add complexity to the overall system by doing so.\nThere is no need to try to differentiate between a Sonic and a Z06 when it comes to phone integration. There’s just not. There’s so many other places. Like there’s a PDR [Performance Data Recorder] in a Z06. You’re not going to find one of those in a Spark, or else you’d be really disappointed with the results! [Laughter.] But there’s a differentiation because it’s meaningful, it’s relevant to the expectations of the customer.\nThat’s why we’re putting phone integration so broadly — because yeah, almost all of our customers have cellphones and smartphones. They use them differently. Their experiences and expectations of them are different. Like the phones themselves — if I took your phone and compared it to my phone, they’re going to be different, because they reflect who we are and our expectations and how I use my phone. There are a lot of things that are the same — a core set. We surf the internet the same, we answer the phone the same way, we use contacts the same way. But beyond that core set, it varies greatly in terms of how we use the phone, and frankly our expectations of what a phone is.\nLikewise, what we’re doing with the car is kind of the same way. There’s certain stuff that’s table stakes, and then beyond that, that’s where you find the opportunity to express the brand and the vehicle’s intent more fully.\nI think this is a really fascinating time for infotainment and the human-machine interface in the car. Like Audi is doing some interesting things where they’re moving everything to the instrument cluster, they don’t even have a center stack in some vehicles. Acura has two touchscreens in the center stack now. What are some of the technologies on the horizon that you think are exciting or going to be game-changers that aren’t necessarily ready for market today?\nThat I can talk about? I think voice has a long way to go in the car, and really, far-field auto environment voice has got a lot of room for improvement, and as it does, it’s going to greatly change the experience in the vehicle. We’re probably going to have to go back and try to engage people again that had bad voice experiences, and have given up on that to try to get them back into that as we make improvements in that area.\nI don’t particularly think gesture [control] is terribly relevant, because it’s such a closed-in space. But the moment you take your hand off the wheel, to even make a gesture, the difference between that and interacting with something in a physical way is a pretty small gap that you’re going to jump there. Why add to the complexity of knowing what those gestures are and getting them squared away, because you’re going to have to confirm it somehow, right? Did it get the gesture right? So I’m not quite sure it’s a big solution for us, that one I’m kind of ambivalent about. I haven’t seen something that isn’t just gratuitous.\nAnd that’s what we have to guard against. One of our suppliers of technology brought out their demo car and we’re sitting in the demo car, and he says, \"Hey Phil, push the voice command and tell it to roll down the windows.\" And so I push the button, and I wait two seconds and it beeps, and I say, \"Roll down the windows,\" and it rolls down the window.\nWhy wouldn’t you just push the button?\nRight? Is there a customer need to roll down the windows? Yes. Is it an unmet need? No. And I can roll down them all from right here with one push. It’s an interesting application of technology to solve a problem that’s already been fully solved. Now, if you can take that technology and find something where people have a gap between what their experience is and what the ideal is, yeah, that’s where you go for.\nAnd so, frankly, we’ve done it, and we see a lot of people who are talking technology do it. But throwing technology at problems that are already fully solved or the application of technology to them doesn’t actually move the ball down the field… it creates more confusion and anxiety or complexity in systems, when we all know that the art is in driving simplicity in highly functional things.\nThe innovation is going to be in terms of how you deliver higher operational functionality with lower and lower complexity to it, by getting the car smarter, by leveraging cloud off-boarding much more, to be more predictive, to be more anticipative. That’s an area where I think we have a lot of runway and we’ll change people’s experiences in ways that are very subtle at first and then you’ll stop and look back and say, wow, we’ve come a long way, but we didn’t notice that we moved along in that journey because things had just gotten easier. And once they’re easier, you come to expect that, and it doesn’t seem that revelational.\nIt seems like that journey is a learning process both for customers and for automakers. And one thing that sticks out in my mind is that Lincoln in their last-generation MyLincoln Touch system, it was entirely touch in the center stack. And in their most recent vehicles, they’ve moved back to some knobs. And of course Tesla has had this debate white-hot for the past several years with their giant touchscreen and no knobs at all. You mentioned the power windows example, but what is the ongoing role of tactile control for the driver versus, say, touchscreens? Do you have a bright line between functions should be controllable with physical control versus what can be controlled via voice control or touch?\nMost of them tend to be redundant for a couple reasons. Sometimes, in certain situations, I’ll use rotary knobs, and other times I’ll use steering wheel controls, sometimes I’ll use voice. And it’s almost a per-case basis as to what’s the most appropriate for that function and moment in time that surrounds it. There’s not a universality to that. If I’m sitting parked somewhere and scrolling through stuff, I’m going to use the touchscreen all day long, because that’s far better than knobs or voice. It’s just very convenient and very easy for me to use. And so I’m waiting to pick up something at the store, my wife ran in for something, and I’m scrolling through something — that’s a great experience, as opposed to going down the road doing 80 miles per hour, 75 miles per hour, 70 miles per hour, that’s probably not the right experience and we lock some of that out.\nThe one thing about the car environment that’s different than a smartphone is the car environment is highly contextual. Some of that context could be driving fast, could be sitting still, but there’s very distinct differences between that and how you have to experience and interact with the car. With a smartphone, it’s pan-experiential. It’s almost devoice of context, intentionally so. It wants to be the chameleon, it wants to move and change. Its purpose and intent is to draw you into it, to absorb you into it, and the car is the exact opposite of that. Different times, different applications. So there aren’t any bright lines. We have those raging debates ourselves. The designers hate knobs. People seem to still like them, and for certain applications like our Cadillac Cue system — volume up-down is a slide, it’s a swipe on that. It’s a little rough! That’s not precise, or you can use the steering wheel controls, but people still like the knob to turn things up and down. So for that purpose, there’s a great application for that. Now will that change in ten years as people become used to something else? Sure, but right now it’s going to be a mix of rotary controls.\nIt depends on the car, the reach zone of a car, too. Right? With certain cars — in a Spark, putting a rotary control in makes very little sense because you can almost touch all four windows without moving. Now, in a CT6 or another vehicle where the hood lines are much further out, rotary controls make a lot more sense. So it’s the dynamic of the car. All of these things play into what is right in that regard. So there is not a single answer.\nDo you think that you will get to full over-the-air updatability of your systems? You have LTE in virtually every car that rolls off your line, at least in the US and a few other markets. Are you approaching that point where taking your car into the dealership for, say, the Android Auto update is a thing of the past?\nWe’re moving that direction, we’re not there today. Certain parts, really bluntly, certain parts of the vehicle were designed to be updated over the air, other parts of the vehicle weren’t designed to be updated over the air. And the designs of those and how they iterate in vehicle systems that are — I don’t know, 80 ECUs [electronic control units] in a vehicle, right? How many of those were designed from scratch to be updated over the air or just iterated from a prior world where it wasn’t connected?\nSo, for example, we’ve been updating the OnStar module — what we call the VCP — in a vehicle for years, because by its very nature it’s a connected device. By the fact that it’s on a carrier’s network means we have to be able to keep up with those things. And we’ve done other things with that. So we’ve been updating parts of a car for many, many years. We do it very frequently, we just don’t make pronouncements about it. We want to do it so people don’t need to know, it’s just done for them and it’s just magic that their car keeps working. Even though the world around them is changing, the car keeps working. We’ve done other body modules and control modules in the vehicle, we’ve updated them over the air because they were capable of doing that.\nSo we’re going to keep building on that list of items or parts of the vehicle that are capable of doing that, and working through all of the infrastructure that needs to be in place in order to do that effectively.\nSo let’s switch gears a little bit. The DMCA exemption came through this week, and I know that GM had been one of many automakers that had misgivings about that exemption. What are the short-term and long-term implications for you? Are you more worried now that people are going to screw up their car in some way that makes it unsafe, or do you think that you can safeguard that while still playing within the bounds of the exemption?\nI don’t have an easy answer for it, because we have to understand what exactly that means, what we have to do in response to that. But first and foremost is what you said — a car is a car, and making sure that it is still safely a car. We talk about being customer centric, well, some of the time that means keeping people from harming themselves, because they don’t understand what it means to build a car. That’s what we’re here for, right? We have that expertise. So there’s not a short list of answers on that. I think we’re still evaluating exactly what that means and what we have to do to respond to it, and what the implications are to our customers and making sure that we’re balancing all of those things.\nThere’s some conversation happening right now that Google is working on, beyond Android Auto, a full-fledged Android-based platform for the car, perhaps along the lines of what QNX does. Is that something that you would consider at some point?\nWe’re not an operating system company. We aren’t going to write our own operating system, so we will always be getting an operating system from somebody, whether it’s Linux-based, or it’s QNX-based, or it’s WinCE-based, or it’s Android-based. And as such, we’ll evaluate and look at the pros and cons and the values of each one of those for what our intended purpose is. How will they handle real-time? Because right now, Android doesn’t do real-time so well, or not at all. Boot times, all of these things are very relevant and important to that, and if they have a solution to that that we think has strengths and benefits to that and has the right commercial implications, we’ll certainly look at it.\nBut to me, I consider an operating system a little bit like transmission fluid. As a company, we want to make sure we pick the right transmission fluid so that the transmissions run as well as anybody else and it’s got all the benefits and the pros and cons of it, right? Will we ever talk about that transmission fluid to a customer? No. What we’re going to talk about is, hey, your car shifts quieter, it gets better gas mileage, you don’t have to worry about your transmission, the car is more durable. But you don’t talk about the fluid, you just talk about the results. We don’t talk about what cars of ours have QNX, which have Linux, which has whatever else in it, because that’s not relevant to the car nor will it ever be. What’s relevant is what the car can do for them, and we’ll continue to express that.\nThat being said, Android is a brand that people recognize, in a way that Linux and QNX aren’t. Well, Linux maybe, for some people.\nBut the relevance of that to the vehicle experience… there will never be millions of an apps for a vehicle, simply because a vehicle is not a smartphone. It’s not a smartphone on wheels, it’s a car. It’s a vehicle. It is what it is. And the applications that are going to be in that vehicle — going back to talking about relevancy and contextually applicability, you don’t need ten flashlight apps and a few beer chugging apps in the car.\nThe value of that device — you can separate the hardware from the platform of it, right? 10 to 15 percent is the hardware, 85 to 90 percent is the \"platforminess\" of it. Because it is a platform, it’s intended to be a platform, and that’s what it’s delivered as. So you can take and do whatever you want to do with it.\nA car is a car. A $50,000 car — the majority of the value of that vehicle is going to be defined by the vehicleness of it, right? How well it moves your stuff from here to there, the styling of it. Now, more and more, how you interact with it is moving up the charts. Believe me, that’s why I’m there, that’s why I joined the company, because that changed. But it will always be within the context of it being a vehicle. It’s not a general-purpose device.\nAnd so, talking about Android in the car means that if you’re an Apple user, you’re going to think that car’s not for you. Well, that’s not what we want to do, and it’s untrue along with it. And we’re a founding member of OAA. We’ve been working with Google on Android variants for a long time, all nature of it. I doubt you’ll ever see the little green guy on the dash of one of our cars, because it’s not relevant to the purchasing criteria. It’s not relevant to the expression of the benefits of the vehicle. We’ve got to turn that into the benefits, because in a car, it’s those benefits, it’s not the platforminess of it.\nTo what extent do you have challenges keeping the various platforms GM has for infotainment across different brands in sync? You have GMC, you have Cadillac, you have…\nYeah, global.\nAnd they’re all slightly different UXes, right?\nYeah, right. We’re working very hard to do that. We’ve talked about all the transitions. If you go back maybe five years ago, there were 27 different suppliers of what you would consider radios or infotainment systems across GM’s portfolio. And when it was speaker wire, power, and an antenna jack, it didn’t make much difference. The interface between it and the car, the car and the user were interchangeable. And so every local market found a radio in the local market and jammed it into the dash of a car.\nAs we’ve moved in towards being more and more integrated into the experience of a car, from 27 we’re down around five or six now, we’re converging that number, we’re driving that number down. For the simple reasons of, one, the integration of it to the rest of the vehicle and the vehicle experiences is increasing, so that proliferation is death to that. Number two, we’re creating connected systems, so now you’ve got something between the vehicle and the outside world, so now if you multiply here, you’ve got both sides now having to deal with that proliferation, which now you’ve squared or doubled at least the impact of having that. So we’re continuing to try to march that down to as few as we can, while allowing for meaningful differentiation between the brands and the vehicles.\nDo you think you’ll need to get to the point where you have 100 percent, if not LTE, some form of connectivity in your vehicles that allows GM to push OTA updates?\nWe’ve stated as a goal that we’re going to actively connect all of our vehicles on a global basis. I think we said 2019, we’d have over 75 percent of our fleet, global volume, connected in that time frame.\nAnd some of it is going to be market-driven. I’m sorry, there’s not a lot of 4G in Uzbekistan, however we have a huge market share — Chevrolet has a huge market share in Uzbekistan. It’s going to be tough a 4G LTE carrier and deployment in a meaningful way in that market any time soon. We’ve launched it in US and Canada, we launched it in Europe earlier this year, we’ve launched it in China earlier this month. So China, Europe, US, Canada, that’s a big chunk of volume on a global basis that will be 4G LTE connected and we’ve launched OnStar in Brazil, not 4G but we’re going to migrate to 4G because some of the network isn’t where it needs to be in a lot of regards down there as well.\nSo we’re going to keep on knocking them down and rolling it out and it’s not going to be overnight, it’s going to take several years, partly because of us, partly because of what the market readiness is for it.\n  \"[Tesla's] customers are essentially beta testers for them in a lot of regards. And people love it!\"  \n[GM executive vice president] Mark Reuss mentioned that mentioned that the Bolt is going to have an evolution of Chevrolet’s infotainment system in some regard. What can you say about that, and more generally, how, if at all, will electrification affect how you think about infotainment systems?\nElectrification is a plus. The core needs of driving, whether it’s an electric vehicle or a gas engine, are the same. The experience is going to be the same, and so for that, 95 percent commonality, we’re going to have the same infotainment needs and have those met.\nNow electrification does present some new opportunities, because of the very nature of it and the information that you need to exchange with the customer, especially on a pure battery car. And so that presents new opportunities to create new experiences for customers, so that’s that incremental part where you can pick your routing on what is the best path for regenerative braking or you avoid the hills or it sets the mode of the car based on the terrain ahead of it. So there is a whole new set of car-relevant experiences that you want to create for that vehicle that is different than you have with an internal combustion engine.\nNow, because we’re putting in place systems inside the vehicles that are far more capable than they have been in the past, to deliver these new capabilities that are relevant to driving a battery electric vehicle. So we’re really working on finding those unique things. And with the Bolt, to explore a little bit, because of the nature of that vehicle and the nature of the people that are going to be buying that vehicle. Their latitude for technology and putting up with foibles of it are probably a little bit broader than somebody buying a Buick LaCrosse.\nI know Tesla’s getting away with stuff that, you know, their customers are essentially beta testers for them in a lot of regards. And people love it! They know what they’re being asked to go through, and the fact that they had 32 updates… I’d be freaking, I know some people who would freak out that they had 32 updates. My God, why didn’t they get it right upfront, what are they doing? And other people are like, cool, that’s great, just keep on working at it. My windshield wipers didn’t work the other day, now they do. Great! But we wouldn’t have put the vehicle in the market if the wipers didn’t work, and so, once again, the acceptance of these things change by those demographics and those markets. So what Mark was saying was we’re going to have a little more latitude to try some things that maybe wouldn’t be as accommodating to a broad customer base where we have to be a little more conservative in our approach.\n"
}
