{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/30/9646876/ariana-grande-focus-music-video-samsung-galaxy-note-5",
    "language": "english",
    "text": "Ariana Grande has a new music video for a single called \"Focus.\" This is its story.\nSCENE: Samsung marketing team crisis management meeting after Drake performed the most viral song of the year whilst holding an iPhone in each hand.\nMan 1: Okay I'm tired of negativity, let's have some solutions.\nMan 2: We just need to do the exact same thing but with a different celebrity, right?\nMan 1: Yes, but who is famous other than Drake... Adele?\nMan 2: Flip phone.\nMan 1: Justin Bieber?\nMan 2: He's with Drake now.\n Man 1: Ariana Grande?\nMan 2: Yes, that is a person.\nMan 1: What if she used the stylus and she wrote a sexy note on the Note 5... with the stylus?\nMan 2: It's called an \"S Pen,\" but yes, perfect. What if, and bear with me, several minutes later when some more people come out with more Note 5s, she's super surprised and opens her mouth out of surprise?\nMan 1: Brilliant sir, you are brilliant.\nMan 2: Okay, what else would Ariana Grande do if she had a Samsung Galaxy Note 5?\nMan 1: Selfies? Young female celebrity... selfies I think?\nMan 1: How many Galaxy Note 5s do you think should be in the video?\nMan 2: No more than 11.\nMan 2: Do you think if we turned them into galaxies that people would like, get it?\nMan 1: What do you mean... turn them into galaxies?\nMan 2: Like, what if Ariana Grande and all her dancers were galaxies all of a sudden.\nMan 1: Impossible.\nMan 2: Okay, just their outfits.\nMan 1: Oh, you mean like black Rockette costumes but covered with those glow-in-the-dark stars that kids put on their bedroom ceilings?\nMan 2: Exactly.\nMan 1: Should we hire a choreographer so they can do a cool dance after they become galaxies?\nMan 2: Unnecessary.\nMan 2: Do you think she would dye her hair the color of a Samsung Galaxy Note 5 in White Pearl if we asked?\nMan 3: Um, literally who would not want to do that?\nMan 2: Weird time to contribute, but thanks for your support.\nMan 3: I'm writing an 800-word email with my sty... erm... S Pen.\nMan 1: Everyone is going to have White Pearl hair after this video, I'm so excited.\nMan 2: What a great meeting, I seriously can't believe it's my job to command culture and create trends.\nMan 1: Oh wait, one last thing. What should the overall aesthetic of the video be?\nMan 2: \"Beauty School Dropout\" from Grease.\nNote: As Ariana Grande is a massively talented vocalist, the song \"Focus\" itself is very pleasant to listen to without visuals.\n"
}
