{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/10/31/9647118/how-to-be-human-high-school-friend",
    "language": "english",
    "text": "Leah Reich  was one of the first internet advice columnists. Her column \"Ask Leah \" ran on IGN, where she gave advice to gamers for two and a half years. During the day, Leah is Slack’s user researcher, but her views here do not represent her employer. You can write to her at askleah@theverge.com and read more How to be Human here.\nDear Leah,\nI'm a 15-year-old boy and I first met this girl in fifth grade (now I'm in tenth). She came from another school to our small class of ten people. We got along well, and by seventh grade we became good friends. We got along pretty well and I soon started having a crush on her. Then by the second half of eighth grade, we started talking less. Here in eighth grade we have to take an exam that decides where we continue learning. I had a pretty good result at the exam (she did, too) and I got into the class I wanted to. She went to another class in the same school. I tried to maintain our friendship, but I couldn't. Since I'm socially awkward I couldn't socialize in the new school, and I haven't made any new friends. I realized I just wasn't capable of having a conversation. There were some old friends with whom I still talked, but very rarely. She soon decided to transfer to our class where me and her best friend were. I was very happy, hoping we could restore our friendship and maybe go even further. It didn't happen. \nShe quickly became friends with many of my classmates, but no matter how hard I tried I couldn't restore our friendship. \nNow that tenth grade started, I set out various goals for myself for the year. Restoring our friendship was the most important of them all. I started inviting her to cultural events I knew she would like. She politely declined all of them, saying she was busy. Then I invited her to cinema with another friend of ours who is also passionate about movies. She declined. So I was gonna go with that friend of ours to the cinema. At the last minute we called it off, because he didn't have time. I was disappointed, and in my disappointment I wrote to her if she would be free sometime next week, so we could watch the movie together. Of course I was hoping that this would give us opportunity to talk about stuff and start knowing each other again. \nThe answer I got from her was the following \"[my name], I wouldn't like to go out with you at all. Sorry :(\" I don't know how could I be so dumb that I didn't realize this since she started declining my invites. It really hurts. I don't have any real friends and I accepted that. But losing the last person with whom I hoped to have something in common, really hurts. She clearly said she doesn't want to be friends. I'm pretty sure about that, because she doesn't care about me, while she does about most other people. And why it really hurts is that we used to be very good friends. Now that she clearly told me to forget her I'm afraid there is no going back. Please don't tell me to get over it, because I'm gonna find someone else. It won't work. I won't find someone else, especially not like her. I considered her my last friend. \nI just want to get her back at least as a friend! How?\nThanks,\nB.\nHey B,\nDon't worry. I'm not going to tell you to \"get over it.\" I hate being told to \"get over it.\" It's dismissive, and more than that, it's totally not helpful. \"Why don't you just get over it?\" \"Oh, wow, what a great idea! I'll just magically get over it! Man, why didn't I think of that?\"\nFeelings, as you obviously know, do not work that way.\nSo I'm not going to tell you to get over it. Unfortunately, that doesn't mean I'm going to tell you something you'll like any better. I'm sorry about this, and I wish I could tell you only great stuff right now. But the best thing I can do here is be honest.\nBeing 15 sucks. It sucks! The whole period, from like 12 until, well, later, is often not very good. I'm not telling you this as someone who's older and wants to dismiss what you're feeling because it's not important or because you're young and don't know any better. I'm telling you this as someone who knows that while there are some fun parts, being a teenager can be pretty terrible.\nBeing a teenager can be pretty terrible\nI'm sure you've heard this already, if not from your parents then in articles. As a teenager, your brain is doing all kinds of weird stuff, getting itself to the place where it's no longer quite so overrun by hormones and intensity and so many feelings. But the problem with being a teenager isn't just your own brain, it's that you are surrounded constantly by brains just like yours. A lot of teenagers are smart, compassionate, kind, good people, but they're under so many pressures —  biological, social, academic — that it's hard for those great qualities to shine all the time. It's a crazy tough time!\nWhy am I telling you all this before I get to your problem? Because you're in a place right now where the vast majority of your social sphere is made up of the people you go to school with. That means a bunch of other teenagers who are trying to figure shit out, just like you. But it also means you — very reasonably — have the feeling that THIS IS IT. THIS IS YOUR ENTIRE WORLD. THERE'S NO ONE ELSE OUT THERE. Because in a way there isn't! At least not until you move and head off to university or wherever it is you go.\nI know, telling someone \"it gets better, you'll grow out of it\" is just as bad as saying \"get over it.\" But I'm not telling you that, because to be totally honest adulthood is more like high school than a lot of us would like to admit. What I am saying is I'm sorry you're having a hard time, and I'm sorry your friend no longer wants to be with you, and I'm sorry you got news that made you feel so bad.\nBut here's what I think is going on, and here's where I think you can make things better. In fact, I think this will help you long after your teenage years are (thankfully) behind you.\nIn your letter, you tell me two things. Let's start with the first one: you were hoping you could restore your friendship with this girl and that things might go further. B, I'm going to bet that what was making your friend avoid you wasn't that she didn't want to be friends, it's that she could tell you liked her. Maybe also she could tell that you felt she was your one and only friend, and the combined pressure of those two things was more than she could handle. Maybe her popularity made her less able to find a place for you in her life but she doesn't seem like a mean person, not as you've described her — she may have been blunt in turning you down, but she was straightforward when you asked, and that counts for a lot in my book.\nFeeling things intensely is a gift but also something you have to learn to manage\nI'm not saying this is your fault, or that yes you should have seen the signs. It's hard to see them when you're caught up in feelings — friendship, desire, loneliness. This is something you can learn to be aware of about yourself: you feel things intensely. Guess what? I do too. I feel things so deeply and so powerfully and sometimes get so overwhelmed by my feelings that I lose sight of the bigger picture or even how I'm acting. Feeling things at this level is a gift but it's also something you — and I! — have to learn to manage, because a lot of people aren't like this! You don't stop having those feelings, you simply learn to let them shine where they'll be welcome and appreciated. It's one of those things you spend a lifetime figuring out. I'm still tinkering with it a lot.\nSo maybe the intensity of your feelings, which were likely compounded by the mere fact of being 15 and existing in the crazy social pressure cooker of high school, felt like a lot to your friend. That's okay! It's okay for you to feel intensely, and it's okay for your friend not to feel comfortable. You did something very right, which is this: as soon as she told you honestly what she felt, you backed off. You stopped. You came to me before you did anything.\nYes, I know you want to get her back as a friend but I think you know what you're asking. You're saying \"oh shit, I think I was just TOO MUCH, and how do I back it up and do it right?\" That's an honorable thing to want — not to get mad at her or try and make her your friend, but to want to take back some of the intensity and do the whole thing over again so she's not uncomfortable.\nGive it time and space\nOkay B. Now for the bad news: you can't get your friend back, at least not right now. The only thing you can do is give it some time and space. She's going to feel more pressured if you try to explain to her what happened, or if you try to get her back, and she's not going to be able to distinguish between \"B who wanted to be her friend and maybe more\" from \"B who just wants to be her friend.\"\nMy hope is that in a while — maybe in a few months but unfortunately maybe not until high school is over — you guys can be friendly again. You can say \"Sorry, I really didn't mean to miss the signs. I had a big crush on you, but I also missed you a lot as a friend, and it was a hard time for me. I hope we can be pals again.\"\nI know, you probably don't find this helpful. \"Ugh, I have to say goodbye to my only friend and then wait until, what, college to be friends with her?\" Yes. Also, the secret hidden good news is when you get to college, you will expand your social circle with all new people, many of whom will also describe themselves as socially awkward, and you will probably find a set friends who mean the world to you, regardless of what happens with this girl.\nOh, and as for that second thing I mentioned above: you say in this letter you were going to the cinema with this girl and a mutual guy friend. Maybe that guy isn't as great as your ex-best friend, and maybe you're not as close with him as you were with her, but he's someone you can hang out with. Do fun stuff with him. Let him be someone you can spend time with, a friend who helps you feel less socially awkward. Maybe you'll even meet some other friends with similar interests. Try to reconnect with your old friends too. You might not be good at making conversation but it's a skill you can learn and practice. Sounds dumb, but it's true. I know a lot of socially awkward people - I sometimes am one myself - and we're out here fumbling through conversations and uncomfortable social events every day. We're all learning!\nYou're not going to get over this girl. I know that. But I also know she's not your last friend in the universe. I know this, too.\n"
}
