{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2015/11/2/9657270/hp-split-hewlett-packard-garage-share-rights",
    "language": "english",
    "text": "Hewlett-Packard is splitting into two companies — HP Inc. and Hewlett Packard Enterprise — but the venerable technology firm isn't cutting all of its ties with the past. The New York Times reports that the two new entities will re-use a number of HP's most storied locations in the company's hometown of Palo Alto, preserving important places from the past to give employees an insight into HP's 77-year history.\nEmployees will be able to visit the original offices of the HP founders\nBoth of the new companies will have access to the garage that served as HP's first headquarters when William Hewlett and David Packard first founded the company in 1939, and employees will be able to peruse a variety of early computers, printers, and other devices housed in the company museum. HP Inc, which will continue to make the PCs and printers that made HP world famous, will inhabit the company's previous research and development labs, while the offices of the HP founders, left untouched after their exit during the 1990s, will also be sealed off and given a new entrance to be used by both new firms.\nAlthough David and William's garage creation helped create the culture and concept of Silicon Valley, the company has slipped from its position as the world's biggest PC seller, losing out to Chinese rival Lenovo as the overall global PC market declines, and announcing layoffs of more than 55,000 people in August. Meg Whitman, CEO of HP since 2011, has stressed the need for change as HP becomes two. \"We're leaving behind a company that was very large, running two businesses that were very different,\" she said last week. \"We're creating two new big companies, not bite-sized morsels, with real capabilities to change things.\" But even as the two new HPs try to turn their fortunes around by looking forward, the maintenance of company relics means that its employees will have constant reminders of past glories, years of history, and \"the HP Way.\"\n"
}
