{
    "status": "OK",
    "usage": "By accessing AlchemyAPI or using information generated by AlchemyAPI, you are agreeing to be bound by the AlchemyAPI Terms of Use: http://www.alchemyapi.com/company/terms.html",
    "url": "http://www.theverge.com/2016/3/2/11145676/htc-vive-pre-vr-headset-preview",
    "language": "english",
    "text": "Of all the virtual reality headsets out there, the HTC Vive feels most like what science fiction visionaries promised us in the ‘80s and ‘90s. Yes, every single product evokes the same set of comparisons: jacking into the Matrix, hanging out on the Holodeck. These are always wrong — with this generation of VR, there’s no forgetting that the world you inhabit is virtual, not real. But in the Vive, a room-scale virtual reality setup focused on letting wearers interact with that world as naturally as possible, the comparison seems less hyperbolic than usual.\nCreated by phone manufacturer HTC and gaming company Valve, the Vive has impressed us in small doses since it was announced in 2015. But late last week, Valve sent us a Vive Pre, a development kit very similar to the final hardware shipping next month. It’s the first chance I’ve had to spend real, sustained time with a top-notch VR system. Last time I was able to use a consumer headset in the wild (with the Samsung Gear VR), I came away disappointed, worrying that the technology couldn’t offer enough to justify its awkwardness. It’s too soon to make a call on the Vive as something you should buy or not, but it makes a better case for VR — as both an entertainment device and a new computing interface — than anything I’ve ever tried.\nThe first difference between the Vive and other headsets appears when you start setting it up. While tracking in VR usually involves placing a camera in front of or around you, the Vive includes two tiny black boxes to mount in the corners of your room; we used light stands, but you can also screw them into the wall or put them on top of a bookcase. (They have a standard ¼-inch, 20 TPI tripod screw mount on the bottom.) The boxes project lasers over an area up to 15 by 15 feet, letting sensors in the headset and controllers calibrate location. If you’ve got enough space, it at least gets the \"deck\" part of Holodeck partially right — you’re not pressing buttons or taking tentative little steps, you’re actually pacing around a room. It’s excellent at shutting out reality, too. You can lean down and peek through the nosepiece just a little, but it’s a highly effective blindfold.\nThis isn’t without its costs. All high-end VR headsets look bulky, but the Vive is in a league of its own: a bulbous, pockmarked face mask with a braid of wires running straight out the top and over your head, its straps a few inches short of forming a full wetsuit hood. The Pre actually has fewer cords than the original development kit, which featured wired controllers and a connector between the two lighthouse boxes. But the remaining ones become a long cable dragging behind you, plugging into a small box that in turn connects to a powerful PC.\n  The Vive at least gets the 'deck' part of Holodeck right  \nThe wireless controllers, which look like TV remotes topped with large rings of sensors, are also a little heavy. They don’t feel as well-balanced as Oculus’ Touch controllers, which won’t come out until later this year. But they track almost perfectly, and they last long enough between Micro USB charges that an indicator — weirdly, seen on the controllers only in VR — still shows them at half-power after about six hours. Most interactions involve a solidly clicky trigger on the underside or a small round trackpad on the top, with side bumpers that you can activate by squeezing. A dedicated home button sits just beneath the trackpad, pulling up a flat version of the Steam interface and a blue laser pointer that you’ll use to make selections. It’s a clear and simple interface, except for one thing: the home button is right under my thumb joint, where it’s incredibly easy to accidentally press. Few things are more frustrating than seeing your Steam library pop up in the middle of a heated Ninja Trainer session.\nThe headset itself suffers from some problems that have long plagued VR. The close-fitting foam mask gets soaked with sweat if you overexert yourself, which becomes off-putting when you’re passing it around a group. The lenses don’t fog up nearly as badly as some early headsets, but they’re easy to accidentally smear. The screen quality is excellent by VR standards, but you can still pick out pixels if you try. These last two flaws are issues for everybody, not just HTC and Valve, and they’re a distinct drawback for first-generation virtual reality in general — especially when you’re talking about a product that costs hundreds of dollars, not a $99 Gear VR.\nStill, the Vive is remarkably comfortable. I’m incapable of playing most mobile VR games (and plenty of early Rift games) for more than half an hour without nausea, but I’ve felt only a twinge of motion sickness in all my hours with the Vive, and it was triggered by a mini-golfing game that I teleported around way too quickly. Early on, I got mild intermittent headaches, but taking a short break or just loosening the headset quelled them. The motion tracking is so close to perfect that there’s no disorientation, no sick-making mismatch between what you’re seeing and what your body is doing. The weirdest part of using the Vive, really, is realizing that it requires a totally new kind of computing setup — and that it’s potentially good enough to make the change feel almost natural.\nWith a relatively simple headset like the Gear VR, virtual reality can be an awkward, finicky offshoot of normal phone and laptop use. I’ll pull a headset out only to remember that I can’t play most VR games on my couch, sigh, and either move to the spinning chair at my desk or forget about the whole endeavor. In theory, the Vive should be even more alienating. It supports seated experiences, but the games I’ve seen use a mix of standing in place, moving a couple of steps to each side, or strolling around a larger space. You quickly learn to step clear of the cord during normal walking, but it still gets tangled if you’re turning frequently.\n  You don't realize how much space furniture takes up until you're calibrating a VR room  \nSimilarly, you don’t realize how small a room is — or how much space furniture takes up — until you’re measuring out a perimeter for your Vive space. The Vive’s chaperone system, which brings up a faint grid whenever you get within a foot or two of the edge, can usually stop you from outright running into a wall. The Vive’s front-facing camera, which isn’t yet active, will also show you a detailed outline of the real world if you reach outside VR space. But the Vive Pre won’t account for the chair you forgot to push in, or the friend who’s wandered up to see what you’re doing — and who might unintentionally block the laser tracking system too. I’ve so far avoided accidentally pistol-whipping anybody in the Vive, but anyone who’s used a Wii Remote should know that swinging a controller around comes with all kinds of risks — there’s a reason the Vive’s hardware incorporates wrist straps.\nBut overall, the experience is so different that it doesn’t invite comparisons to anything else. Oculus and Sony have shown off several games that play like ordinary console platformers, shooters, and role-playing games, even if virtual reality gives them a new feel. Valve and HTC don’t ban traditional gamepads (or chairs), but they barely acknowledge their existence, treating the included motion controllers as the default way to use VR. With the exception of totally passive vignettes, everything Valve is showcasing with the Vive Pre uses motion in some form, whether you’re painting, shooting, fencing, or drawing airplane flight paths in mid-air. With the best of them, you don’t think to wonder why you’re walking around and waving your arms, any more than you’d wonder why there’s no mouse on a smartphone.\nTilt Brush, arguably the strongest experience on the Vive, is a perfect example. It’s a painting program that treats three-dimensional space as a canvas, resulting in pieces that fuse sculpture and illustration. Tilt Brush could use slightly more complex options — even with my limited artistic vision, I found myself wishing for things like layers and scaling or rotation. But it’s got enough depth that I could imagine seeing something like it (or Oculus’ Quill tool) in a professional setting, and it’s something that can only be done well with motion tracking and augmented or virtual reality.\nAccording to one estimate, well over a hundred games and experiences have announced Vive support, but Valve sent the Pre with around 10 interactive pieces, several of them demos for full games like Job Simulator, plus a handful of passive experiences that have appeared at Sundance or previous events. Some of the games are either adaptations or near-clones of existing concepts, but interestingly, they’re from simple mobile games rather than realistic 3D ones.\n  Finally, a fencing simulator based on Fruit Ninja  \nFinal Approach is like iOS game Flight Control blown up into a whole series of complex miniature landscapes, which you’ll stride across like a benevolent air traffic control giant. Fantastic Contraption is the direct successor to a 2D physics game of the same name. Ninja Trainer might as well be called Fruit Ninja VR. But the similarities are mostly thematic. Ninja Trainer, for example, is the closest thing I’ve seen to a sword-fighting simulator, a cartoony spin on Sixense’s lightsaber training demo. The current version is a one-minute demo. SteamVR tells me I’ve spent several hours in it.\nThe most interesting part of this interface is that it changes the way you can use electronics. Moving your hands to paint, let alone swinging around a virtual sword, is a lot more tiring than using a mouse and keyboard. The cadence of playing video game becomes more like playing sports: you can do it for hours, but eventually you’re going to wear yourself out and hit a wall. And with tools like Tilt Brush, VR becomes a standing desk that doesn’t feel like an exercise in righteous self-denial.\nThe obvious criticism here is that we already tried and rejected a motion interface: the Kinect. I won’t rule out the comparison, but the Vive has at least assured me that VR controllers can be far, far more precise and reliable than my Kinect ever was. And on a conceptual level, VR does a better job of linking physical action to visual results. If somebody made a Vive version of the adorable Kinectimals, for example, you’d still technically be waving your hands in the air and looking at a screen. But as far as your eyes were concerned, you’d have a baby tiger right at your fingertips.\nAs with the Kinect, the Vive’s success will depend on what people do with it, and Valve offers only a handful of demos with the Vive Pre. Its larger software experience remains rough, and some features — like the ability to pair your phone and get calls in VR — don’t exist yet. There’s no way to make a final call on the Vive’s quality, or whether it’s worth $800. But it’s probably safe to predict that next month, you’ll be able to buy the first complete virtual reality system, it’s going to cost more than most people can afford, it’s going to give a lot of computer geeks’ arms a workout, and it’s going to be ridiculously fun for anyone who gets to try it out.\n"
}
